[
  {
    "id": 1,
    "type": "Sleeping",
    "heading": "Supplications at the time of sleeping",
    "totalCount": 4,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of sleeping",
    "numOfDuas": 4,
    "arabic": "اٰمَنَ الرَّسُوۡلُ بِمَاۤ اُنۡزِلَ اِلَیۡہِ مِنۡ رَّبِّہٖ وَ الۡمُؤۡمِنُوۡنَ ؕ کُلٌّ اٰمَنَ بِاللّٰہِ وَ مَلٰٓئِکَتِہٖ وَ کُتُبِہٖ وَ رُسُلِہٖ ۟ لَا نُفَرِّقُ بَیۡنَ اَحَدٍ مِّنۡ رُّسُلِہٖ ۟ وَ قَالُوۡا سَمِعۡنَا وَ اَطَعۡنَا ٭۫ غُفۡرَانَکَ رَبَّنَا وَ اِلَیۡکَ الۡمَصِیۡرُ ﴿۲۸۵﴾ لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَاْ لَهَامَا\nكَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَالا\nتُوَاخِذُنَا إِنْ تَّسِيْنَا أوْ اَخْطَأْناً رَبَنَاوَلا\nتَحْيِلُ عَلَيْنَآ اِصْرًاكَمَا حَمَلْتَهَ عَلَى\nانَّذِيْنَ مِنْ قَبْلِنَا رَبَنَاوَلَا تُحَتِّلْنَا مَالَا\nطَاقَةًَ لَنَابِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَاٌ وَ\nارْحَمْنَا أَنْتَ مَوْلينَا فَانْصُرْنَا عَلَى الْقَوْمِ\nالْكُفِرِ يْنَ",
    "roman": "",
    "translation": "The Messenger believes in what has been send down to him from his Lord, and so do the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. They say: \"\"We make no distinction between any of His Messengers,\"\" and they say: \"\"We hear, and we obey. (We seek) Your Forgiveness, our Lord, and to You is the return.\"\" Allah burdens not a person beyond what he can bear. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned. Our Lord! Punish us not if we forget or fall into error. Our Lord! Lay not on us a burden like that which You did lay on those before us. Our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us forgiveness. Have mercy on us. You are our Protector, and help us against the disbelieving people.",
    "refText": "These two Verses will be sufficient for anyone who recites them at night before sleeping. Al-Bukhari, cf. Al-Asqalani, Fathul-Bari.",
    "refType": "Quran",
    "refChapter": "Al-Baqarah 2:285-6"
  },
  {
    "id": 1,
    "type": "Sleeping",
    "heading": "Supplications at the time of sleeping",
    "totalCount": 4,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of sleeping",
    "numOfDuas": 4,
    "arabic": "اللّٰھُمَّ بِاسْمِکَ اَمُوْتُ وَاَحْیَا",
    "roman": "",
    "translation": "In Your Name , O Allah , I die and I live.",
    "refText": "Here, dying and living are metaphors for sleep and wakefulness. This explains why the normal order of these words has been reversed in this Hadith. In other contexts the living is mentioned before dying.",
    "refType": "Quran",
    "refChapter": "Al-Baqarah 2:258, Aal-'Imrdn 3:156, Al-A'raf 7:158"
  },
  {
    "id": 1,
    "type": "Sleeping",
    "heading": "Supplications at the time of sleeping",
    "totalCount": 4,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of sleeping",
    "numOfDuas": 4,
    "arabic": "اَللّٰھُمَّ اِنَّکَ خَلَقْتَ نَفْسِیْ وَاَنْتَ تَوَفَّاھَا، لَکَ مَمَاتُھَا وَمَحْیَاھَا اِنْ اَحْیَیْتَھَا فَاحْفَظْھَا وَاِنْ اَمَتَّھَا فَاغْفِرْلَھَا، اَللّٰھُمَّ اِنِّیْٓ اَسْئَلُکَ الْعَافِیَۃَ",
    "roman": "",
    "translation": "O Allah, You have created my soul and You take it back. Unto You is its death and its life . If You give it life then protect it , and if You cause it to die then forgive it. O Allah, I ask You for strength.",
    "refText": "Before you go to bed perform ablutions as you would for prayer, then lie down on your right side and say:The Prophet (SAW) said: \"\"Whoever says this and dies in his sleep, has died in a state of the natural monotheism (Fitrah).\"\" Al-Bukhari, cf. Al-Asqalani, Fathul-Bari",
    "refType": "Hadith",
    "refChapter": "Muslim 4/2083 and Ahmad 2/79."
  },
  {
    "id": 1,
    "type": "Sleeping",
    "heading": "Supplications at the time of sleeping",
    "totalCount": 4,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of sleeping",
    "numOfDuas": 4,
    "arabic": "اَللّٰھُمَّ اَسْلَمْتُ نَفْسِیْٓ اِلَیْکَ وَفَوَّضْتُ اَمْرِیْٓ اِلَیْکَ وَوَجَّھْتُ وَجْھِیْ اِلَیْکَ وَاَلْجَاتُ ظَھْرِیْ اِلَیْکَ، رَغْبَۃً وَّرَھْبَۃً اِلَیْکَ لَا مَلْجَاَ وَلَا مَنْجَاَ مِنْکَ اِلَّآ اِلَیْکَ اٰمَنْتُ بِکِتَابِکَ الَّذِیْٓ اَنْزَلْتَ وَبِنَبِیِّکَ الَّذِیْٓ اَرْسَلْتَ",
    "roman": "",
    "translation": "O Allah,1 I submit myself to You, entrust my affairs to You, turn my face to You, and lay myself down depending upon You , hoping in You and fearing You . There is no refuge , and no escape, except to You. I believe in Your Book (the Qur'an) that You revealed, and the Prophet whom You sent.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/113, Muslim 4/2081."
  },
  {
    "id": 2,
    "type": "Morning",
    "heading": "Supplications at the time of awakening",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of awakening",
    "numOfDuas": 2,
    "arabic": "اَلْحَمْدُ لِلّٰہِ الَّذِیْٓ اَحْیَانَا بَعْدَ مَآ اَمَاتَنَا وَاِلَیْہِ النُّشُوْرُ",
    "roman": "",
    "translation": "Praise is to Allah Who gives us life after He has caused us to die and to Him is the return.",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/113; Muslim 4/2083"
  },
  {
    "id": 2,
    "type": "Morning",
    "heading": "Supplications at the time of awakening",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of awakening",
    "numOfDuas": 2,
    "arabic": "اَلْحَمْدُ لِلّٰہِ الَّذِیْٓ عَافَانِیْ فِیْ جَسَدِیْ وَرَدَّ عَلَیَّ رُوْحِیْ وَاَذِنَ لِیْ بِذِکْرِہٖ",
    "roman": "",
    "translation": "Praise is to Allah Who gave strength to my body and returned my soul to me and permitted me to remember Him.",
    "refText": "At-Tirmithi See Al-Albani's Sahih Tirmiihi",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 5/473. See Al-Albani's Sahih Tirmiihi 3/144."
  },
  {
    "id": 3,
    "type": "Daily",
    "heading": "Supplication before entering Lavatory",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication before entering Lavatory",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللّٰہِ اَللّٰھُمَّ اِنِّیْٓ اَعُوْذُبِکَ مِنَ الْخُبْثِ وَالْخَبَآئِثِ",
    "roman": "",
    "translation": "(Before entering) [In the Name of Allah] . (Then) O Allah , I seek protection in You from the male and female unclean spirits.",
    "refText": "The addition of Bismillah at its beginning was reported by Said bin Mansur. See Fathul-Bari",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 1/45, Muslim 1/283."
  },
  {
    "id": 4,
    "type": "Daily",
    "heading": "Supplication when exiting Lavatory",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication when exiting Lavatory",
    "numOfDuas": 1,
    "arabic": "غُفْرَانَکَ",
    "roman": "",
    "translation": "I seek Your forgiveness.",
    "refText": "Abu Dawud, Ibn Majah and At-Tirmithi. An-Nasa'i recorded it in 'Amalul-Yawm wal-Laylah. Also see the checking of Ibn Al-Qayyim's Zadul-Ma'ad,",
    "refType": "Hadith",
    "refChapter": "Ibn Al-Qayyim's Zadul-Ma'ad, 2/387."
  },
  {
    "id": 5,
    "type": "Prayer",
    "heading": "Supplication to Enter mosque",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication to Enter mosque",
    "numOfDuas": 1,
    "arabic": "عُوْذُ بِاللّٰہِ الْعَظِیْمِ وَبِوَجْھِہِ الْکَرِیْمِ وَسُلْطَانِہِ الْقَدِیْمِ مِنَ الشَّیْطَانِ الرَّجِیْمِ بِسْمِ اللّٰہِ وَالصَّلٰوۃُ وَالسَّلَامُ عَلٰی رَسُوْلِ اللّٰہِ اَللّٰھُمَّ افْتَحْ لِیْ اَبْوَابَ رَحْمَتِکَ",
    "roman": "",
    "translation": "I seek refuge in Almighty Allah, by His Noble Face, by His primordial power, from Satan the outcast.1 [In the Name of Allah, and blessings.]2 [And peace be upon the Messenger of Allah.]3 O Allah, open before me the doors of Your mercy.4",
    "refText": "Abu Dawud, Ibn Majah and At-Tirmithi. An-Nasa'i recorded it in 'Amalul-Yawm wal-Laylah. Also see the checking of Ibn Al-Qayyim's Zadul-Ma'ad,",
    "refType": "Hadith",
    "refChapter": "Sahih Ibn Majah 1/128-9."
  },
  {
    "id": 6,
    "type": "Prayer",
    "heading": "Supplication when leaving mosque",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication when leaving mosque",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللّٰہِ وَالصَّلٰوۃُ وَالسَّلَامُ عَلٰی رَسُوْلِ اللّٰہِ اَللّٰھُمَّ اِنِّیْٓ اَسْئَلُکَ مِنْ فَضْلِکَ اَللّٰھُمَّ اعْصِمْنِیْ مِنَ الشَّیْطَانِ الرَّجِیْم",
    "roman": "",
    "translation": "In the Name of Allah, and peace and blessings be upon the Messenger of Allah. O Allah, I ask for Your favor, O Allah, protect me from Satan the outcast.",
    "refText": "Reference: ibid.",
    "refType": "Hadith",
    "refChapter": "ibid"
  },
  {
    "id": 7,
    "type": "Prayer",
    "heading": "Supplication before ablution",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication before ablution",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللّٰہِ",
    "roman": "",
    "translation": "In the Name of Allah",
    "refText": "Abu Dawud, Ibn Majah, and Ahmad. See also Al-Albani, 'Irwa'ul-Ghain",
    "refType": "Hadith",
    "refChapter": "Al-Albani, 'Irwa'ul-Ghain 1/122."
  },
  {
    "id": 8,
    "type": "Prayer",
    "heading": "Supplication after ablution",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication after ablution",
    "numOfDuas": 1,
    "arabic": "اَشْھَدُ اَنْ لَّآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ وَاَشْھَدُ اَنَّ مُحَمَّدًا عَبْدُہٗ وَرَسُوْلُہٗ",
    "roman": "",
    "translation": "I bear witness that none has the right to be worshipped but Allah alone, Who has no partner; and I bear witness that Muhammad is His slave and His Messenger.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "Muslim 1/209."
  },
  {
    "id": 9,
    "type": "Daily, Prayer",
    "heading": "Supplication and recitation of Durood after Azan",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication and recitation of Durood after Azan",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ رَبَّ ھٰذِہِ الدَّعْوَۃِ التَّآمَّۃِ وَالصَّلٰوۃِ الْقَآئِمَۃِ اٰتِ مُحَمَّدَ ۨ  الْوَسِیْلَۃَ وَالْفَضِیْلَۃَ وَابْعَثْہُ مَقَامًا مَّحْمُودَ  ۨ الَّذِیْ وَعَدْتَّہٗ (اِنَّکَ لَا تُخْلِفُ الْمِیْعَادَ)",
    "roman": "",
    "translation": "After replying to the call of Mu'aththin. you should recite in Arabic Allah's blessings on the Prophet.O Allah , Lord of this perfect call and established prayer. Grant Muhammad the intercession and favor, and raise him to the honored station You have promised him, [verily You do not neglect promises].",
    "refText": "Al-Bukhari and the addition between brackets is from Al-Bayhaqi 1/410 with a good (Hasan) chain of narration. See 'Abdul-Azlz bin Baz's Tuhfatul-'Akhyar,",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 1/152"
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "اَللّٰہُ اَکْبَرُ",
    "roman": "",
    "translation": "Allah is the Greatest",
    "refText": "Sahih Muslim",
    "refType": "Hadith",
    "refChapter": "Sahih Muslim 583"
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "اَللّٰھُمَّ اَعِنِّیْ عَلٰی ذِکْرِکَ وَشُکْرِکَ وَحُسْنِ عِبَادَتِکَ",
    "roman": "",
    "translation": "",
    "refText": "Sahih Muslim",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "لَآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ، لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ وَھُوَ عَلٰی کُلِّ شَیْئٍ قَدِیْرٌ  اَللّٰھُمَّ لَا مَانِعَ لِمَآ اَعْطَیْتَ وَلَا مُعْطِیَ لِمَا مَنَعْتَ وَلَا یَنْفَعُ ذَا الْجَدِّ مِنْکَ الْجَدُّ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, He has no partner, His is the dominion and His is the praise, and He is Able to do all things. O Allah, there is none who can withhold what You give, and none may give what You have withheld; and the might of the mighty person cannot benefit him against You.",
    "refText": "Al-Bukhari Muslim",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 1/255, Muslim 1/414."
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "لَآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَا شَرِیْکَ لَہٗ، لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ وَھُوَ عَلٰی کُلِّ شَیْئٍ قَدِیْرٌ،لَا حَوْلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰہِ، لَآ اِلٰہَ اِلَّا اللّٰہُ وَلَا نَعْبُدُ اِلَّآ اِیَّاہُ، لَہُ النِّعْمَۃُ وَلَہُ الْفَضْلُ وَلَہُ الثَّنَآئُ الْحَسَنُ لَآ اِلٰہَ اِلَّا اللّٰہُ مُخْلِصِیْنَ لَہُ الدِّیْنَ وَلَوْکَرِہَ الْکَافِرُوْنَ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, He has no partner, His is the dominion and His is the praise and He is Able to do all things. There is no power and no might except by Allah . None has the right to be worshipped but Allah, and we do not worship any other besides Him . His is grace , and His is bounty",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "Muslim 1/415."
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "سُبْحَانَ اﷲِ، (33) مرتبہ،  اَلْحَمْدُلِلّٰہِ، (33) مرتبہ،  اَللّٰہُ اَکْبَرُ(33) مرتبہ،  (ایک مرتبہ)  لَآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ، لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ وَھُوَ عَلٰی کُلِّ شَیْئٍ قَدِیْرٌ",
    "roman": "",
    "translation": "Glory is to Allah , and praise is to Allah , and Allah is the Most Great (each said thirty-three times). None has the right to be worshipped but Allah alone, He has no partner, His is the dominion and His is the praise and He is Able to do all things.",
    "refText": "Whoever says this after every prayer will be forgiven his sins even though they be as the foam of the sea",
    "refType": "Hadith",
    "refChapter": "Muslim 1/418,"
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "َللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَۚ اَلۡحَیُّ الۡقَیُّوۡمُ  ۬ ۚ لَا تَاۡخُذُہٗ سِنَۃٌ وَّ لَا نَوۡمٌ ؕ لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ مَنۡ ذَا الَّذِیۡ یَشۡفَعُ  عِنۡدَہٗۤ  اِلَّا بِاِذۡنِہٖ ؕ یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ  ۚ وَ لَا یُحِیۡطُوۡنَ بِشَیۡءٍ مِّنۡ عِلۡمِہٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ کُرۡسِیُّہُ السَّمٰوٰتِ وَ الۡاَرۡضَ ۚ وَ لَا یَئُوۡدُہٗ حِفۡظُہُمَا ۚ وَ ہُوَ الۡعَلِیُّ  الۡعَظِیۡمُ",
    "roman": "",
    "translation": "Allah! There is none worthy of worship but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this",
    "refText": "An-Nasa'i, 'Amalul-Yawm wal-Laylah  also Ibn As-Sunni ( See also Al-Albani, Sahihul and Silsilatul-Ahadith As-Sahihah",
    "refType": "Hadith",
    "refChapter": "Al-Albani, Sahihul-Jami' As-Saghir 5/339 and Silsilatul-Ahadith As-Sahihah 2/697 (no. 972)."
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "لَآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ، لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ یُحْیٖ وَیُمِیْتُ وَھُوَ عَلٰی کُلِّ شَیْئٍ قَدِیْرٌ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise . He brings life and He causes death , and He is Able to do all things. (Recite ten times in Arabic after the Maghrib and Fajr prayers.)",
    "refText": "At-Tirmithi . See its checking in Ibn Al-Qayyim Al-Jawziyyah's Zadul-Ma'ad",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 5/515, Ahmad 4/227"
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَسْئَلُکَ عِلْمًا نَافِعًا وَّرِزْقًا طَیِّبًا وَّعَمَلًا مُّتَقَبَّلًا",
    "roman": "",
    "translation": "O Allah, I ask You for knowledge that is of benefit , a good provision , and deeds that will be accepted. (Recite in Arabic after the Fajr prayer.)",
    "refText": "Ibn Majah and others. See Al-Albani, Sahih Ibn Majah and Majma'uz-Zawd'id",
    "refType": "Hadith",
    "refChapter": "Al-Albani, Sahih Ibn Majah 1/152 and Majma'uz-Zawd'id 10/111."
  },
  {
    "id": 10,
    "type": "Daily",
    "heading": "Supplication after Tasleem",
    "totalCount": 9,
    "numSubCategories": 0,
    "subHeading": "Supplication after Tasleem",
    "numOfDuas": 9,
    "arabic": "اَسْتَغْفِرُاللّٰہَ، اَسْتَغْفِرُاللّٰہَ، اَسْتَغْفِرُاللّٰہَ، اَللّٰھُمَّ اَنْتَ السَّلَامُ وَمِنْکَ السَّلَامُ تَبَارَکْتَ یَا ذَا الْجَلَالِ وَالْاِکْرَامِ",
    "roman": "",
    "translation": "I seek the forgiveness of Allah (three times) . O Allah, You are Peace and from You comes peace . Blessed are You , O Owner of majesty and honor.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "Muslim 1/414."
  },
  {
    "id": 11,
    "type": "Prayer",
    "heading": "Supplication of Vitr (Qunut)",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication of Vitr (Qunut)",
    "numOfDuas": 2,
    "arabic": "اَللّٰھُمَّ اھْدِنِیْ فِیْمَنْ ھَدَیْتَ وَعَافِنِیْ فِیْمَنْ عَافَیْتَ وَتَوَلَّنِیْ فِیْمَنْ تَوَلَّیْتَ وَبَارِکْ لِیْ فِیْمَآ اَعْطَیْتَ وَقِنِیْ شَرَّ مَا قَضَیْتَ فَاِنَّکَ تَقْضِیْ وَلَا یُقْضٰی عَلَیْکَ اِنَّہٗ لَا یَذِلُّ مَنْ وَّالَیْتَ (وَلَا یَعِزُّ مَنْ عَادَیْتَ) تَبَارَکْتَ رَبَّنَا وَتَعَالَیْتَ",
    "roman": "",
    "translation": "O Allah , guide me with those whom You have guided , and strengthen me with those whom You have given strength. Take me to Your care with those whom You have taken to Your care. Bless me in what You have given me. Protect me from the evil You have ordained. Surely, You command and are not commanded",
    "refText": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmithi, Ahmad, Ad-Darimi, Al-Hakim, and Al-Bayhaqi. See also Al-Albani, Sahih At-Tirmithi Sahih Ibn Majah  and 'Irwa'ul-GhaW.",
    "refType": "Hadith",
    "refChapter": "Al-Albani, Sahih At-Tirmithi 1/144, Sahih Ibn Majah 1/194, and 'Irwa'ul-GhaW. 2/ 172."
  },
  {
    "id": 11,
    "type": "Prayer",
    "heading": "Supplication of Vitr (Qunut)",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication of Vitr (Qunut)",
    "numOfDuas": 2,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَعُوْذُ بِرِضَاکَ مِنْ سَخَطِکَ وَبِمُعَافَاتِکَ مِنْ عُقُوْبَتِکَ وَاَعُوْذُبِکَ مِنْکَ، لَآ اُحْصِیْ ثَنَآئً عَلَیْکَ اَنْتَ کَمَآ اَثْنَیْتَ عَلٰی نَفْسِکَ",
    "roman": "",
    "translation": "O Allah , I seek refuge with Your Pleasure from Your anger . I seek refuge in Your forgiveness from Your punishment . I seek refuge in You from You . I cannot count Your praises , You are as You have praised Yourself.",
    "refText": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmithi, Ahmad. See Al-Albani, Sahih At-Tirmithi  Sahih Ibn Majah  and 'Irwa'ul-Ghalil.",
    "refType": "Hadith",
    "refChapter": "Sahih Ibn Majah 1/194, and 'Irwa'ul-Ghalil. 2/ 175."
  },
  {
    "id": 12,
    "type": "Prayer",
    "heading": "Supplication after performing Vitr",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication after performing Vitr",
    "numOfDuas": 2,
    "arabic": "سُبْحَانَ الْمَلِکِ الْقُدُّوْسِ",
    "roman": "",
    "translation": "Glory is to the King, the Holy. [Recite three times in Arabic, and raise and extend the voice on the third time and say . . .]",
    "refText": "",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 12,
    "type": "Prayer",
    "heading": "Supplication after performing Vitr",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication after performing Vitr",
    "numOfDuas": 2,
    "arabic": "رَبُّ الْمَلَآئِکَۃِ وَالرُّوْحِ",
    "roman": "",
    "translation": "Lord of the angels and the Spirit.",
    "refText": "The final addition is from Ad-Daraqutni's version  and its chain of narration is authentic. See the checking of Zadul-Ma'ad by Shu'aib Al-Arna'ut and 'Abdul-Qadir Al-Arna'ut",
    "refType": "Hadith",
    "refChapter": "Abdul-Qadir Al-Arna'ut 1/337."
  },
  {
    "id": 13,
    "type": "Protection, Daily, Travel",
    "heading": "Invocation seeking help from Allah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Invocation seeking help from Allah",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَسْتَخِیْرُکَ بِعِلْمِکَ وَاَسْتَقْدِرُکَ بِقُدْرَتِکَ وَاَسْئَلُکَ مِنْ فَضْلِکَ الْعَظِیْمِ فَاِنَّکَ تَقْدِرُ وَلَآ اَقْدِرُ وَتَعْلَمُ وَلَآ اَعْلَمُ وَاَنْتَ عَلَّامُ الْغُیُوْبِ، اَللّٰھُمَّ اِنْ کُنْتَ تَعْلَمُ اَنَّ ھٰذَا الْاَمْرَ خَیْرٌ لِّیْ فِیْ دِیْنِیْ وَمَعَاشِیْ وَعَاقِبَۃِ اَمْرِیْ فَاقْدُرْہُ لِیْ وَیَسِّرْہُ لِیْ ثُمَّ بَارِکْ لِیْ فِیْہِ وَاِنْ کُنْتَ تَعْلَمُ اَنَّ ھٰذَا الْاَمْرَ شَرٌّ لِّیْ فِیْ دِیْنِیْ وَمَعَاشِیْ وَعَاقِبَۃِ اَمْرِیْ فَاصْرِفْہُ عَنِّیْ وَاصْرِفْنِیْ عَنْہُ وَاقْدُرْ لِیَ الْخَیْرَ حَیْثُ کَانَ ثُمَّ اَرْضِنِیْ بِہٖ",
    "roman": "",
    "translation": "O Allah, I seek the counsel of Your Knowledge, and I seek the help of Your Omnipotence, and I beseech You for Your Magnificent Grace. Surely, You are Capable and I am not. You know and I know not, and You are the Knower of the unseen. O Allah, if You know that this matter [then mention the thing to be decided]",
    "refText": "",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 7/162. and Aal-'Imran 3:159."
  },
  {
    "id": 14,
    "type": "Prayer",
    "heading": "Supplications of prostration after recitation",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications of prostration after recitation",
    "numOfDuas": 2,
    "arabic": "سَجَدَ وَجْھِیَ لِلَّذِیْ خَلَقَہٗ وَشَقَّ سَمْعَہٗ وَبَصَرَہٗ بِحَوْلِہٖ وَقُوَّتِہٖ فَتَبٰرَکَ اللّٰہُ اَحْسَنُ الْخَالِقِیْنَ",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 14,
    "type": "Prayer",
    "heading": "Supplications of prostration after recitation",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications of prostration after recitation",
    "numOfDuas": 2,
    "arabic": "اَللّٰھُمَّ اَکْتُبْ لِیْ بِھَا عِنْدَکَ اَجْرًا وَّضَعْ عَنِّیْ بِھَا وِزْرًا وَّاجْعَلْھَا لِیْ عِنْدَکَ ذُخْرًا وَّتَقَبَّلْھَا مِنِّیْ کَمَا تَقَبَّلْتَھَا مِنْ عَبْدِکَ دَاوٗدَ",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 15,
    "type": "Morning, Evening",
    "heading": "Supplications and prayers of Morning and Evening",
    "totalCount": 5,
    "numSubCategories": 0,
    "subHeading": "Supplications and prayers of Morning and Evening",
    "numOfDuas": 5,
    "arabic": "حَسْبِیَ اللّٰہُ لَآ اِلٰہَ اِلَّا ھُوَ عَلَیْہِ تَوَکَّلْتُ وَھُوَ رَبُّ الْعَرْشِ الْعَظِیْمِ",
    "roman": "",
    "translation": "Allah is sufficient for me . There is none worthy of worship but Him . I have placed my trust in Him, He is Lord of the Majestic Throne . (Recite seven times in Arabic .)",
    "refText": "Allah will grant whoever recites this seven times in the morning or evening whatever he desires from this world or the next, Ibn As-Sunni  Both reports are attributed directly to the Prophet  The chain of transmission is sound (Sahih). Ibn As-Sunni.",
    "refType": "Hadith",
    "refChapter": "Ibn As-Sunni (no. 71), Abu Dawud 4/321. Both"
  },
  {
    "id": 15,
    "type": "Morning, Evening",
    "heading": "Supplications and prayers of Morning and Evening",
    "totalCount": 5,
    "numSubCategories": 0,
    "subHeading": "Supplications and prayers of Morning and Evening",
    "numOfDuas": 5,
    "arabic": "بِسْمِ اللّٰہِ الَّذِیْ لَا یَضُرُّ مَعَ اسْمِہٖ شَیْئٌ فِی الْاَرْضِ وَلَا فِی السَّمَآئِ وَھُوَ السَّمِیْعُ الْعَلِیْمُ",
    "roman": "",
    "translation": "In the Name of Allah, Who with His Name nothing can cause harm in the earth nor in the heavens, and He is the All-Hearing, the All-Knowing. (Recite three times in Arabic).",
    "refText": "Whoever recites it three times in the morning will not be afflicted by any calamity before evening, and whoever recites it three times in the evening will not be overtaken by any calamity before morning.\"\" Abu Dawud 4/323, At-Tirmithi 5/465, Ibn Majah 2/332, Ahmad. Ibn Majah's chain of transmission is good (Hasan), Ibn Baz, p. 39.",
    "refType": "Hadith",
    "refChapter": "Abu Dawud 4/323, At-Tirmithi 5/465, Ibn Majah 2/332,"
  },
  {
    "id": 15,
    "type": "Morning, Evening",
    "heading": "Supplications and prayers of Morning and Evening",
    "totalCount": 5,
    "numSubCategories": 0,
    "subHeading": "Supplications and prayers of Morning and Evening",
    "numOfDuas": 5,
    "arabic": "اَعُوْذُ بِکَلِمَاتِ للّٰہِ التَّآمَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "roman": "",
    "translation": "I seek refuge in the Perfect Words of Allah from the evil of what He has created. (Recite three times in Arabic in the evening .)",
    "refText": "Whoever recites this three times in the evening will be protected from insect stings, Ahmad  An-Nasa'i, 'Amalul-Yawm wal-Laylah At-Tirmithi  Ibn As-Sunni no. 68. According to Al-Albani, Ibn Majah's  chain of transmission is sound (Sahih), and following Ibn Baz -Tirmithi's report is good (Hasan).",
    "refType": "Hadith",
    "refChapter": "Ibn Majah's (2/266) chain of transmission is sound (Sahih), and following Ibn Baz 45, At-Tirmithi's report is good (Hasan)."
  },
  {
    "id": 15,
    "type": "Morning, Evening",
    "heading": "Supplications and prayers of Morning and Evening",
    "totalCount": 5,
    "numSubCategories": 0,
    "subHeading": "Supplications and prayers of Morning and Evening",
    "numOfDuas": 5,
    "arabic": "رَضِیْتُ بِاللّٰہِ رَبًّا وَّبِالْاِسْلَامِ دِیْنًا وَّبِمُحَمَّدٍ نَبِیًّا",
    "roman": "",
    "translation": "I am pleased with Allah as my Lord, with Islam as my religion and with Muhammad (peace and blessings of Allah be upon him) as my Prophet. (Recite three times in Arabic .)",
    "refText": "I am pleased with Allah as my Lord, with Islam as my religion and with Muhammad (peace and blessings of Allah be upon him) as my Prophet. (Recite three times in Arabic .)",
    "refType": "Hadith",
    "refChapter": "Ahmad 4/ 337, An-Nasa'i, 'Amalul-Yawm wal-Laylah p. 4, Ibn As-Sunni (no. 68), At-Tirmithi 5/465. Its chain of transmission is good (Hasan), Ibn Baz, p. 39."
  },
  {
    "id": 15,
    "type": "Morning, Evening",
    "heading": "Supplications and prayers of Morning and Evening",
    "totalCount": 5,
    "numSubCategories": 0,
    "subHeading": "Supplications and prayers of Morning and Evening",
    "numOfDuas": 5,
    "arabic": "سُبْحَانَ اللّٰہِ وَبِحَمْدِہٖ عَدَدَ خَلْقِہٖ وَرِضَا نَفْسِہٖ، وَزِنَۃَ عَرْشِہٖ وَمِدَادَ کَلِمَاتِہٖ",
    "roman": "",
    "translation": "Glory is to Allah and praise is to Him, by the multitude of His creation, by His Pleasure, by the weight of His Throne, and by the extent of His Words. (Recite three times in Arabic upon rising in the morning .)",
    "refText": "Glory is to Allah and praise is to Him, by the multitude of His creation, by His Pleasure, by the weight of His Throne, and by the extent of His Words. (Recite three times in Arabic upon rising in the morning .)",
    "refType": "Hadith",
    "refChapter": "Muslim 4/2090."
  },
  {
    "id": 16,
    "type": "Trials",
    "heading": "Supplication for solving Problems/Troubles",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for solving Problems/Troubles",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ لَا سَھْلَ اِلَّا مَا جَعَلْتَہٗ سَھْلًا وَّاَنْتَ تَجْعَلُ الْحَزَنَ اِذَا شِئْتَ سَھْلًا",
    "roman": "",
    "translation": "O Allah, there is no ease other than what You make easy. If You please You ease sorrow.",
    "refText": "Ibn Hibban in his Sahih  and Ibn As- Sunni  Al-Hafidh (Ibn Hajar) said that this Hadith is authentic. It was also declared authentic by 'Abdul-Qadir Al-Arna'ut in his checking of An-Nawawi's Kitabul-Athkarp.",
    "refType": "Hadith",
    "refChapter": "Ibn Hibban in his Sahih (no. 2427), and Ibn As- Sunni (no. 351)."
  },
  {
    "id": 17,
    "type": "Trials",
    "heading": "Supplications upon anxiety/depression",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications upon anxiety/depression",
    "numOfDuas": 3,
    "arabic": "لَآ اِلٰہَ اِلَّا اللّٰہُ الْعَظِیْمُ الْحَلِیْمُ، لَآ اِلٰہَ اِلَّا اللّٰہُ رَبُّ الْعَرْشِ الْعَظِیْمِ، لَآ اِلٰہَ اِلَّا اللّٰہُ رَبُّ السَّمٰوٰتِ وَرَبُّ الْاَرْضِ وَرَبُّ الْعَرْشِ الْکَرِیْمِ",
    "roman": "",
    "translation": "There is none worthy of worship but Allah the Mighty, the Forbearing. There is none worthy of worship but Allah, Lord of the Magnificent Throne. There is none worthy of worship but Allah, Lord of the heavens and Lord of the earth, and Lord of the Noble Throne.",
    "refText": "Al-Bukhari  Muslim",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 17,
    "type": "Trials",
    "heading": "Supplications upon anxiety/depression",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications upon anxiety/depression",
    "numOfDuas": 3,
    "arabic": "َللّٰھُمَّ رَحْمَتَکَ اَرْجُوْ فَلَا تَکِلْنِیْ اِلٰی نَفْسِیْ طَرْفَۃَ عَیْنٍ وَّاَصْلِحْ لِیْ شَاْنِیْ کُلَّہٗ لَآ اِلٰہَ اِلَّآ اَنْتَ",
    "roman": "",
    "translation": "O Allah , I hope for Your mercy . Do not leave me to myself even for the blinking of an eye (i.e. a moment) . Correct all of my affairs for me . There is none worthy of worship but You.",
    "refText": "Abu Dawud / Ahmad  Al-Albani graded it as good in Sahih Abu Dawud",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 8/154, Muslim 4/2092"
  },
  {
    "id": 17,
    "type": "Trials",
    "heading": "Supplications upon anxiety/depression",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications upon anxiety/depression",
    "numOfDuas": 3,
    "arabic": "اَللّٰہُ اَللّٰہُ رَبِّیْ لَآ اُشْرِکُ بِہٖ شَیْئًا",
    "roman": "",
    "translation": "Allah, Allah is my Lord. I do not associate anything with Him.",
    "refText": "Abu Dawud . See also Al-Albani, Sahih Ibn Mdjah",
    "refType": "Hadith",
    "refChapter": "Al-Albani graded it as good in Sahih Abu Dawud 3/959."
  },
  {
    "id": 18,
    "type": "Trials",
    "heading": "Supplications to be free from debts/loans",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications to be free from debts/loans",
    "numOfDuas": 3,
    "arabic": "اَللّٰھُمَّ اکْفِنِیْ بِحَلَالِکَ عَنْ حَرَامِکَ وَاَغْنِنِیْ بِفَضْلِکَ عَمَّنْ سِوَاکَ",
    "roman": "",
    "translation": "O Allah, suffice me with what You have allowed instead of what You have forbidden , and make me independent of all others besides You.",
    "refText": "At-Tirmith See also Al-Albani, Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 5/560. See also Al-Albani, Sahih At-Tirmithi 3/180."
  },
  {
    "id": 18,
    "type": "Trials",
    "heading": "Supplications to be free from debts/loans",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications to be free from debts/loans",
    "numOfDuas": 3,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَعُوْذُبِکَ مِنَ الْھَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْکَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّیْنِ وَغَلَبَۃِ الرِّجَالِ",
    "roman": "",
    "translation": "O Allah , I seek refuge in you from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being overcome by debt and overpowered by men (i .e . others) .",
    "refText": "Al-Bukhari  See also Al-Asqalani, Fathul-Bari",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 7/158. See also Al-Asqalani, Fathul-Bari 11/173."
  },
  {
    "id": 18,
    "type": "Trials",
    "heading": "Supplications to be free from debts/loans",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "Supplications to be free from debts/loans",
    "numOfDuas": 3,
    "arabic": "َللّٰھُمَّ اِنِّیْٓ اَعُوْذُبِکَ مِنْ عَذَابِ الْقَبْرِ وَاَعُوْذُبِکَ مِنْ فِتْنَۃِ الْمَسِیْحِ الدَّجَّالِ وَاَعُوْذُبِکَ مِنْ فِتْنَۃِ الْمَحْیَا وَالْمَمَاتِ، اَللّٰھُمَّ اِنِّیْٓ اَعُوْذُبِکَ مِنَ الْمَاْثَمِ وَالْمَغْرَمِ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from the punishment of the grave, and I seek refuge in You from the trial of the False Messiah, and I seek refuge in You from the trials of life and death. O Allah, I seek refuge in You from sin and from debt.",
    "refText": "Al-Bukhari  Muslim",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 1/202, Muslim 1/412."
  },
  {
    "id": 19,
    "type": "Protection",
    "heading": "Supplication to ask substitute upon difficulties",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication to ask substitute upon difficulties",
    "numOfDuas": 1,
    "arabic": "ِنَّا لِلّٰہِ وَاِنَّا اِلَیْہِ رَاجِعُوْنَ اَللّٰھُمَّ اُجُرْنِیْ فِیْ مُصِیْبَتِیْ وَاَخْلِفْ لِیْ خَیْرًا مِّنْھَا",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 20,
    "type": "Daily",
    "heading": "Supplication when in anxiety",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication when in anxiety",
    "numOfDuas": 1,
    "arabic": "َآ اِلٰہَ اِلَّا اللّٰہُ",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 21,
    "type": "Daily",
    "heading": "Supplication when angry",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication when angry",
    "numOfDuas": 1,
    "arabic": "اَعُوْذُ بِاللّٰہِ مِنَ الشَّیْطٰنِ الرَّجِیْمِ",
    "roman": "",
    "translation": "(Say:) I seek refuge in Allah from Satan the outcast (then spit to your left). (Do this three times reciting in Arabic.)",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "Muslim 4/1729."
  },
  {
    "id": 22,
    "type": "Daily",
    "heading": "Supplication when see a destitute",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication when see a destitute",
    "numOfDuas": 1,
    "arabic": "اَلْحَمْدُ لِلّٰہِ الَّذِیْ عَافَانِیْ مِمَّا ابْتَلَاکَ بِہٖ وَفَضَّلَنِیْ عَلٰی کَثِیْرٍ مِّمَّنْ خَلَقَ تَفْضِیْلًا",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 23,
    "type": "Daily",
    "heading": "Supplication to be safe from polytheism",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication to be safe from polytheism",
    "numOfDuas": 1,
    "arabic": "َللّٰھُمَّ اِنِّیْٓ اَعُوْذُبِکَ اَنْ اُشْرِکَ بِکَ وَاَنَا اَعْلَمُ وَاسْتَغْفِرُکَ لِمَا لَآ اَعْلَمُ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I associate anything with You knowingly, and I seek Your forgiveness for what I know not.",
    "refText": "Ahmad  See also Al-Albani, Sahihul-Jami' As-Saghir  and Sahihut-Targhib wat- Tarhib",
    "refType": "Hadith",
    "refChapter": "Ahmad 4/403. See also Al-Albani, Sahihul-Jami' As-Saghir 3/233 and Sahihut-Targhib wat- Tarhib 1/19."
  },
  {
    "id": 24,
    "type": "Daily",
    "heading": "Supplication to ward off bad omen",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication to ward off bad omen",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ لَا طَیْرَ اِلَّا طَیْرُکَ وَلَا خَیْرَ اِلَّا خَیْرُکَ وَلَآ اِلٰہَ غَیْرُکَ",
    "roman": "",
    "translation": "O Allah there is no portent other than Your portent, no goodness other than Your goodness, and none worthy of worship other than You.",
    "refText": "Ahmad  Ibn As-Sunni  See also Al-Albani, Silsilatul-'Ahadlth As-Sahihah  As for bodings of good, these used to please the Prophet (SAW) and so when he heard good words from someone, he used to say: \"\"We have taken from you a good portent from your mouth,\"\" Abu Dawud, Ahmad. See also Al-Albani, Silsilatul-'Ahadith As-Sahihah  and it is with Abu Ash-Shaikh Al-Asfahani in 'Akhlaqun-Nabiyy,",
    "refType": "Hadith",
    "refChapter": "Al-Albani, Silsilatul-'Ahadith As-Sahihah 2/363, and it is with Abu Ash-Shaikh Al-Asfahani in 'Akhlaqun-Nabiyy, pg. 270."
  },
  {
    "id": 25,
    "type": "Daily",
    "heading": "Supplication after Lunch/Dinner",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication after Lunch/Dinner",
    "numOfDuas": 2,
    "arabic": "اَلْحَمْدُ لِلّٰہِ الَّذِیْٓ اَطْعَمَنِیْ ھٰذَا وَ رَزَقَنِیْہِ مِنْ غَیْرِ حَوْلٍ مِّنِّیْ وَلَا قُوَّۃٍ",
    "roman": "",
    "translation": "Praise is to Allah Who has given me this food and sustained me with it though I was unable to doit and powerless.",
    "refText": "At-Tirmithi, Abu Dawud, and Ibn Majah. See also Al-Albani, Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 3/159."
  },
  {
    "id": 25,
    "type": "Daily",
    "heading": "Supplication after Lunch/Dinner",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication after Lunch/Dinner",
    "numOfDuas": 2,
    "arabic": "اَلْحَمْدُ لِلّٰہِ حَمْدًا کَثِیْرًا طَیِّبًا مُبَارَکًا فِیْہِ غَیْرَ مَکْفِیٍّ وَّلَا مُوَدَّعٍ وَّلَا مُسْتَغْنًی عَنْہُ رَبَّنَا",
    "roman": "",
    "translation": "All praise is to Allah, praise in abundance, good and blessed . It cannot [be compensated for, nor can it] be left, nor can it be done without , our Lord.",
    "refText": "Al-Bukhari-At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 6/214, At-Tirmithi 5/507."
  },
  {
    "id": 26,
    "type": "Dressing",
    "heading": "Supplication upon wearing new dress",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication upon wearing new dress",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ لَکَ الْحَمْدُ اَنْتَ کَسَوْتَنِیْہِ اَسْئَلُکَ، مِنْ خَیْرِہٖ وَخَیْرِ مَا صُنِعَ لَہٗ، وَاَعُوْذُبِکَ مِنْ شَرِّہٖ وَشَرِّ مَا صُنِعَ لَہٗ",
    "roman": "",
    "translation": "O Allah, praise is to You. You have clothed me. I ask You for its goodness and the goodness of what it has been made for, and I seek Your protection from the evil of it and the evil of what it has been made for.",
    "refText": "Abu Dawud and At-Tirmithi. See also Al-Albani, Mukhtasar Shamd'i",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi, p. 47."
  },
  {
    "id": 27,
    "type": "Travel",
    "heading": "Supplication exiting home",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication exiting home",
    "numOfDuas": 2,
    "arabic": "بِسْمِ اللّٰہِ تَوَکَّلْتُ عَلَی اللّٰہِ لَا حَوْلَ وَلَا قُوَّۃَ اِلَّا بِاللّٰہِ",
    "roman": "",
    "translation": "In the Name of Allah, I have placed my trust in Allah, there is no might and no power except by Allah.",
    "refText": "See also Al-Albani, Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "Abu Dawud 4/325, At-Tirmithi 5/490. See also Al-Albani, Sahih At-Tirmithi 3/151"
  },
  {
    "id": 27,
    "type": "Travel",
    "heading": "Supplication exiting home",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication exiting home",
    "numOfDuas": 2,
    "arabic": "اَللّٰھُمَّ اِنِّیْ اَعُوْذُبِکَ اَنْ اَضِلَّ، اَوْ اُضَلَّ، اَوْ اَزِلَّ، اَوْ اُزَلَّ، اَوْ اَظْلِمَ، اَوْ اُظْلَمَ، اَوْ اَجْھَلَ، اَوْ یُجْھَلَ عَلَّی",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I misguide others , or I am misguided by others , lest I cause others to err or I am caused to err , lest I abuse others or be abused, and lest I behave foolishly or meet with the foolishness of others.",
    "refText": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmithi. See also Al-Albani, Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "Sahih At-Tirmithi 3/152 and Sahih Ibn Majah 2/336"
  },
  {
    "id": 28,
    "type": "Travel",
    "heading": "Supplication entering home",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication entering home",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَسْئَلُکَ خَیْرَ الْمَوْلِجِ وَخَیْرَ الْمَخْرَجِ، بِسْمِ اللّٰہِ وَلَجْنَا وَبِسْمِ اللّٰہِ خَرَجْنَا، وَعَلَی اللّٰہِ رَبِّنَا تَوَکَّلْنَا",
    "roman": "",
    "translation": "In the Name of Allah we enter , in the Name of Allah we leave , and upon our Lord we depend [then say As-Salaamu 'Alaykum to those present].",
    "refText": "Abu Dawud  Muslim says that one should mention the Name of Allah when entering the home and when beginning to eat; and that the devil, hearing this, says: \"\"There is no shelter for us here tonight and no food.",
    "refType": "Hadith",
    "refChapter": "Abu Dawud 4/325. Muslim {Hadith no. 2018)"
  },
  {
    "id": 29,
    "type": "Travel",
    "heading": "Supplication entering market",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication entering market",
    "numOfDuas": 1,
    "arabic": "لَآ اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ، لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ، یُحْیٖ وَیُمِیْتُ وَھُوَ حَیٌّ لَّا یَمُوْتُ بِیَدِہِ الْخَیْرُ وَھُوَ عَلٰی کُلِّ شَیْئٍ قَدِیْرٌ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise. He brings life and He causes death, and He is living and does not die. In His Hand is all good, and He is Able to do all things.",
    "refText": "At-Tirmithi  and Al-Hakim  Al-Albani graded it good in Sahih Ibn Majah and Sahih At-Tirmith",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 5/291, and Al-Hakim 1/538. Al-Albani graded it good in Sahih Ibn Majah 2/21 and Sahih At-Tirmithi 3/152."
  },
  {
    "id": 30,
    "type": "Occasion",
    "heading": "Supplication upon sight of moon",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication upon sight of moon",
    "numOfDuas": 1,
    "arabic": "اَللّٰہُ اَکْبَرُ، اَللّٰھُمَّ اَھِلَّہٗ عَلَیْنَا بِالْاَمْنِ وَالْاِیْمَانِ وَالسَّلَامَۃِ وَالْاِسْلَامِ وَالتَّوْفِیْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضٰی، رَبُّنَا وَرَبُّکَ اللّٰہُ",
    "roman": "",
    "translation": "Allah is the Most Great . O Allah , bring us the new moon with security and Faith, with peace and in Islam, and in harmony with what our Lord loves and what pleases Him. Our Lord and your Lord is Allah.",
    "refText": "At-Tirmithi  Ad-Darimi  See also Al-Albani, Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": "At-Tirmithi 5/504, Ad-Darimi 1/336. Al-Albani, Sahih At-Tirmithi 3/157."
  },
  {
    "id": 31,
    "type": "Fasting",
    "heading": "Supplications at the time of breaking fast (Iftar)",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of breaking fast (Iftar)",
    "numOfDuas": 1,
    "arabic": "ذَھَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوْقُ وَثَبَتَ الْاَجْرُ اِنْ شَآئَ اللّٰہُ",
    "roman": "",
    "translation": "The thirst is gone, the veins are moistened and the reward is confirmed, if Allah wills.",
    "refText": "Abu Dawud  and others. See also Al- Albani, Sahihul-Jami' As-Saghir",
    "refType": "Hadith",
    "refChapter": "Abu Dawud 2/306  Al- Albani, Sahihul-Jami' As-Saghir 4/209."
  },
  {
    "id": 31,
    "type": "Fasting",
    "heading": "Supplications at the time of breaking fast (Iftar)",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplications at the time of breaking fast (Iftar)",
    "numOfDuas": 1,
    "arabic": "اَللّٰھُمَّ اِنِّیْٓ اَسْئَلُکَ بِرَحْمَتِکَ الَّتِیْ وَسِعَتْ کُلَّ شِیْئٍ اَنْ تَغْفِرَلِیْ",
    "roman": "",
    "translation": "O Allah, I ask You by Your mercy, which encompasses all things, that You forgive me.",
    "refText": "Ibn Majah from a supplication of Abdullah bin 'Amr. Al-Hafidh graded it as good in his checking of An-Nawawi's Kitabul-'Athkdr. See Sharhul- Athkar",
    "refType": "Hadith",
    "refChapter": "Ibn Majah 1/557  Sharhul- Athkar 4/342."
  },
  {
    "id": 32,
    "type": "Occasion",
    "heading": "Supplications before intercourse",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplications before intercourse",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللّٰہِ اَللّٰھُمَّ جَنِّبْنَا الشَّیْطَانَ وَجَنِّبِ الشَّیْطَانَ مَا رَزَقْتَنَا",
    "roman": "",
    "translation": "With the Name of Allah. O Allah, keep the I Devil away from us and keep the Devil away from that which You provide for us.",
    "refText": "Al-Bukhari and Muslim",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari 6/141, Muslim 2/1028."
  },
  {
    "id": 33,
    "type": "Gratitude",
    "heading": "Supplication upon happiness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication upon happiness",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللّٰہِ اَللّٰہُ اَکْبَرُ",
    "roman": "",
    "translation": "",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 34,
    "type": "Protection",
    "heading": "Supplication to seek refuge of Allah for children",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication to seek refuge of Allah for children",
    "numOfDuas": 1,
    "arabic": "اُعِیْذُ کُمَا بِکَلِمَاتِ اللّٰہِ التَّآمَّۃِ مِنْ کُلِّ شَیْطَانٍ وَّھَآمَّۃٍ وَّمِنْ کُلِّ عَیْنِ لَّآمَّۃٍ",
    "roman": "",
    "translation": "I seek protection for you in the Perfect Words of Allah from every devil and every beast , and from every envious blameworthy eye.",
    "refText": "Al-Bukhari",
    "refType": "Hadith",
    "refChapter": "Al-Bukhari4/119."
  },
  {
    "id": 35,
    "type": "Occasion",
    "heading": "Supplication at the end of gathering",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication at the end of gathering",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَکَ اللّٰھُمَّ وَبِحَمْدِکَ اَشْھَدُ اَنْ لَّآ اِلٰہَ اِلَّآ اَنْتَ اَسْتَغْفِرُکَ وَاَتُوْبُ اِلَیْکَ",
    "roman": "",
    "translation": "Glory is to You, O Allah, and praise is to You. I bear witness that there is none worthy of worship but You. I seek Your forgiveness and repent to You.",
    "refText": "Abu Dawud, Ibn Majah, At-Tirmithi and An-Nasa'i. See also Al-Albani, Sahih At-Tirmithi . Aishah (RA) said: \"\"Allah's Messenger (SAW) did not sit in a gathering, and did not recite the Qur'an, and did not perform any prayer without concluding by saying ... (then she quoted the above).\"\" This was reported by An-Nasa'i in 'Amalul-Yawm wal-Laylah  and Dr. Farooq Hamadah graded it authentic in his checking of the same book, See also Ahmad",
    "refType": "Hadith",
    "refChapter": "Sahih At-Tirmithi 3/ 153.  'Amalul-Yawm wal-Laylah (no.308),  Ahmad 6/77"
  },
  {
    "id": 36,
    "type": "Daily",
    "heading": "Ayat ul Kursi",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Ayat ul Kursi",
    "numOfDuas": 1,
    "arabic": "اَللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَۚ اَلۡحَیُّ الۡقَیُّوۡمُ ۬ ۚ لَا تَاۡخُذُہٗ سِنَۃٌ وَّ لَا نَوۡمٌ ؕ لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ مَنۡ ذَا الَّذِیۡ یَشۡفَعُ  عِنۡدَہٗۤ  اِلَّا بِاِذۡنِہٖ ؕ یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ  ۚ وَ لَا یُحِیۡطُوۡنَ بِشَیۡءٍ مِّنۡ عِلۡمِہٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ کُرۡسِیُّہُ السَّمٰوٰتِ وَ الۡاَرۡضَ ۚ وَ لَا یَـُٔوۡدُہٗ حِفۡظُہُمَا ۚ وَ ہُوَ الۡعَلِیُّ  الۡعَظِیۡمُ ﴿۲۵۵﴾",
    "roman": "",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surat-ul-Baqara 255"
  },
  {
    "id": 37,
    "type": "Protection",
    "heading": "Supplication for Protection from Shaitan:",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Protection from Shaitan:",
    "numOfDuas": 1,
    "arabic": "اَللّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ الشَّيْطَانِ وَفِتْنَتِهِ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from the evil of Shaitan and his mischief.",
    "refText": "This supplication is found in Sahih Muslim, Book 35, Hadith  It is part of the supplications that the Prophet Muhammad (ﷺ) would use to seek Allah's protection from Shaitan and his evil whispers",
    "refType": "Hadith",
    "refChapter": "Sahih Muslim, Book 35, Hadith 6516."
  },
  {
    "id": 38,
    "type": "Guidance",
    "heading": "Supplication for Guidance",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Guidance",
    "numOfDuas": 1,
    "arabic": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
    "roman": "",
    "translation": "Guide us to the Straight Path.",
    "refText": "This dua is from Surah Al-Fatiha which is the opening chapter of the Qur'an. It is the first and most important supplication in the daily prayer (Salah), recited in every unit of prayer (Rak'ah).",
    "refType": "Quran",
    "refChapter": "Surah Al-Fatiha (1:6)"
  },
  {
    "id": 39,
    "type": "Daily",
    "heading": "Supplication  for Forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication  for Forgiveness",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "My Lord, forgive me and have mercy on me.",
    "refText": "This dua is found in Surah Al-Isra  The full verse, in which Allah addresses His command to worship and honor one's parents, is as follows:",
    "refType": "Quran",
    "refChapter": "Surah Al-Isra (17:23)"
  },
  {
    "id": 40,
    "type": "Repentance, Daily",
    "heading": "Supplication for Mercy",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Mercy",
    "numOfDuas": 1,
    "arabic": "رَبِّ رَحْمَتُكَ وَفِرْ لِي",
    "roman": "",
    "translation": "O my Lord, have mercy on me and forgive me.",
    "refText": "This supplication is mentioned in Surah Al-A'raf  The verse is part of the context where Allah describes His mercy and forgiveness. The full verse is as follows:",
    "refType": "Quran",
    "refChapter": "Surah Al-A'raf (7:56)"
  },
  {
    "id": 41,
    "type": "Gratitude",
    "heading": "Supplication for Success",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Success",
    "numOfDuas": 1,
    "arabic": "رَبِّ يَسِّرْ وَلا تُعَسِّرْ",
    "roman": "",
    "translation": "My Lord, make it easy and do not make it difficult.",
    "refText": "This supplication is found in Sahih Muslim, Book 35, Hadith  (or similar references depending on the edition), where the Prophet Muhammad (ﷺ) is reported to have used this dua when seeking",
    "refType": "Hadith",
    "refChapter": "Sahih Muslim, Book 35, Hadith 6565"
  },
  {
    "id": 42,
    "type": "Trials",
    "heading": "Supplication for Health",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Health",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ عَافِنِي فِي بَدَنِي",
    "roman": "",
    "translation": "O Allah, grant me good health.",
    "refText": "This dua is found in Sahih Muslim, Book 35, Hadith  (in some versions it may be referenced as Hadith  It is part of the general supplications that the Prophet Muhammad (ﷺ) recommended for his followers to make for their well-being.",
    "refType": "Hadith",
    "refChapter": "Sahih Muslim, Book 35, Hadith 6569"
  },
  {
    "id": 43,
    "type": "Protection",
    "heading": "Supplication for Protection from Hellfire",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Protection from Hellfire",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ قِني عَذَابَ النَّارِ",
    "roman": "",
    "translation": "O Allah, protect me from the punishment of the Fire.",
    "refText": "This supplication is found in Sahih Muslim, Book 1, Hadith . Specifically, it is part of the supplications taught by the Prophet Muhammad (ﷺ) to protect oneself from the harms of the Hereafter.",
    "refType": "Hadith",
    "refChapter": "Sahih Muslim, Book 1, Hadith 349."
  },
  {
    "id": 44,
    "type": "Trials",
    "heading": "Supplication  for Relief from Worries",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication  for Relief from Worries",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from anxiety and sorrow.",
    "refText": "Sahih al-Bukhari, Book 75, Hadith 348.",
    "refType": "Hadith",
    "refChapter": "Sahih al-Bukhari, Book 75, Hadith 348."
  },
  {
    "id": 45,
    "type": "Trials",
    "heading": "Supplication  for Strength and Patience",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication  for Strength and Patience",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord, pour upon us patience, plant firmly our feet, and give us victory over the disbelieving people.",
    "refText": "Surah Al-Baqarah (2:250)",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 46,
    "type": "Guidance",
    "heading": "Supplication for Steadfastness on the Path of Allah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Steadfastness on the Path of Allah",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
    "roman": "",
    "translation": "Our Lord, pour upon us patience and let us die as Muslims in submission to You.",
    "refText": "This du’a was recited by the magicians who accepted Islam after seeing the miracle of Prophet Musa (peace be upon him).",
    "refType": "Hadith",
    "refChapter": "Surah Al-A'raf (7:126)"
  },
  {
    "id": 47,
    "type": "Gratitude",
    "heading": "Supplication for Ease in Affairs",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Ease in Affairs",
    "numOfDuas": 1,
    "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "roman": "",
    "translation": "Sufficient for us is Allah, and He is the best Disposer of affairs.",
    "refText": "",
    "refType": "Hadith",
    "refChapter": "Surah Aal-E-Imran (3:173)"
  },
  {
    "id": 48,
    "type": "Daily",
    "heading": "Supplication for Knowledge",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Knowledge",
    "numOfDuas": 1,
    "arabic": "رَبِّ زِدْنِي عِلْمًا",
    "roman": "",
    "translation": "My Lord, increase me in knowledge.",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surah Taha (20:114)"
  },
  {
    "id": 49,
    "type": "Travel",
    "heading": "Supplication for Entrance and Exit",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Entrance and Exit",
    "numOfDuas": 1,
    "arabic": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
    "roman": "",
    "translation": "My Lord, cause me to enter a sound entrance and to exit a sound exit, and grant me from Yourself a supporting authority.",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surah Al-Isra (17:80)"
  },
  {
    "id": 50,
    "type": "Protection",
    "heading": "Supplication for protection during the travel",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for protection during the travel",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ  وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ",
    "roman": "",
    "translation": "Glory is to Him Who has subjected this (transport) to us, and we could not have (otherwise) subdued it. And indeed, to our Lord, we will surely return.",
    "refText": "",
    "refType": "Hadith",
    "refChapter": "Sahih Bukhari Hadith Number: 27:55"
  },
  {
    "id": 51,
    "type": "Trials",
    "heading": "Supplication for Strength Against Trials",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Strength Against Trials",
    "numOfDuas": 1,
    "arabic": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "roman": "",
    "translation": "Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surah At-Tawbah (9:129)"
  },
  {
    "id": 52,
    "type": "Protection",
    "heading": "Supplication for Protection from Evil",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Protection from Evil",
    "numOfDuas": 1,
    "arabic": "وَقُلْ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِوَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
    "roman": "",
    "translation": "And say, 'My Lord, I seek refuge in You from the incitements of the devils, and I seek refuge in You, my Lord, lest they be present with me.'",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surah Al-Mu’minun (23:97-98)"
  },
  {
    "id": 53,
    "type": "Trials",
    "heading": "Supplication for Relief from Hardship",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for Relief from Hardship",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "roman": "",
    "translation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
    "refText": "",
    "refType": "Quran",
    "refChapter": "Surah Al-Anbiya (21:87)"
  },
  {
    "id": 54,
    "type": "Travel",
    "heading": "Supplication for leaving the home",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for leaving the home",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِّي أَعوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَزِلَّ أَوْ أُزلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَم، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I misguide others, or I am misguided by others, lest I cause others to err or I am caused to err, lest Iabuse others or be abused, and lest I behave foolishly or meet with the foolishness of others.",
    "refText": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmithi. See also Al-Albani, Sahih At-Tirmithi 3/152 and Sahih Ibn Majah 2/336",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 55,
    "type": "Dressing",
    "heading": "Supplication When wearing a garment",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication When wearing a garment",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ للهِ الَّذِي كَسَانِي هَذَا (القَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلا قُوَّة",
    "roman": "",
    "translation": "All Praise is for Allaah who has clothed me with this [garment] and provided it for me, with no power nor might from myself.",
    "refText": "Al-Bukhari, Muslim, Abu Dawud, Ibn Majah, At-Tirmithi. See also 'Irwa'ul-Ghalil 7/47",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 56,
    "type": "Dressing",
    "heading": "Supplication When wearing a new garment",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication When wearing a new garment",
    "numOfDuas": 1,
    "arabic": "اللهُمَّ لَكَ الْحَمْدُ أنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
    "roman": "",
    "translation": "O Allaah, for You is all praise, You have clothed me with it, I ask You for the good of it and the good for which it was made, and I seek refugewith You from the evil of it and the evil for which it was made",
    "refText": "Abu Dawud and At-Tirmithi. See also Al-Albani, Mukhtasar Shamd'il At-Tirmithi, p. 47",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 57,
    "type": "Dressing",
    "heading": "Supplication said to someone wearing a new garment",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to someone wearing a new garment",
    "numOfDuas": 1,
    "arabic": "تُبْلي وَيُخْلِفُ اللهُ تَعَالى",
    "roman": "",
    "translation": "May you wear it out and Allaah (Ta'aala) replace it [with another]",
    "refText": "Abu Dawud 4/41. See also Al-Albani Sahih Abu Dawud 2/760.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 58,
    "type": "Dressing",
    "heading": "Supplication Before undressing",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Before undressing",
    "numOfDuas": 1,
    "arabic": "بِسْمِ الله",
    "roman": "",
    "translation": "In the name of Allaah",
    "refText": "At-Tirmithi 2/505, among others. See 'Irwa'ul Ghalil no. 49 and Sahihul-Jami' 3/203",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 59,
    "type": "Daily",
    "heading": "Supplication Upon entering the home",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Upon entering the home",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ وَلَجْنا، وَبِسْمِ اللهِ خَرَجْنا، وَعَلى رَبِّنا تَوَكّلْنا",
    "roman": "",
    "translation": "In the Name of Allah we enter , in the Name of Allah we leave, and upon our Lord we depend [then say As-Salaamu 'Alaykum to those present].",
    "refText": "Abu Dawud 4/325. Muslim {Hadith no. 2018) says that one should mention the Name of Allah when entering the home and when beginning to eat; and that the devil, hearing this, says: 'There is no shelter for us here tonight and no food.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 60,
    "type": "Guidance",
    "heading": "Supplication for settling a debt",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication for settling a debt",
    "numOfDuas": 2,
    "arabic": "اللَّهُمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "roman": "",
    "translation": "O Allah, suffice me with what You have allowed instead of what You have forbidden, and make me independent of all others besides You.",
    "refText": "At-Tirmithi 5/560. See also Al-Albani, Sahih At-Tirmithi 3/180",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 60,
    "type": "Guidance",
    "heading": "Supplication for settling a debt",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication for settling a debt",
    "numOfDuas": 2,
    "arabic": "اللّهُمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَمِّ وَالْحَزَنِ، والعَجْزِ والكَسَلِ والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجال",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from | being overcome by debt and from being overpowered by men (i .e. other people).[2]",
    "refText": "Al-Bukhaaree 7/157",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 61,
    "type": "Protection",
    "heading": "Supplication During a wind storm",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication During a wind storm",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنَّي أَسْأَلُكَ خَيْرَها، وَأَعوذُ بِكَ مِنْ شَرِّها",
    "roman": "",
    "translation": "O Allah , I ask You for the good of it and seek refuge in You against its evil.[1]",
    "refText": "Abu Dawud 4/326, Ibn Majah 2/1228. See also Al-Albani, Sahih Ibn Mjjah 2/305",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 62,
    "type": "Protection",
    "heading": "Supplication Upon hearing thunder",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Upon hearing thunder",
    "numOfDuas": 1,
    "arabic": "سُبْحانَ الّذي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالملائِكةُ مِنْ خيفَته",
    "roman": "",
    "translation": "Glory is to Him Whom thunder and angels glorify due to fear of Him.",
    "refText": "Abdullah bin Zubair (RA) would hear thunder, he would abandon all conversation and say this supplication. See Al-Muwatta' conversation and say this supplication. See Al-Muwatta' graded authentic by Al-Albani as a statement of Abdullah bin Zubayr only.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 63,
    "type": "Protection",
    "heading": "Supplication for rain",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for rain",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ اسْقِ عِبادَكَ وَبَهائِمَك، وَانْشُرْ رَحْمَتَكَ وَأَحْيِي بَلَدَكَ المَيِّت",
    "roman": "",
    "translation": "O Allaah, relieve us, O Allaah, relieve us, O Allaah, relieve us.",
    "refText": "Abu Dawud 1/305. Al-Albani graded it good in Sahih Abu Dawud 1/218.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 64,
    "type": "Guidance",
    "heading": "Supplication When it rains",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication When it rains",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ صَيِّباً نافِعاً",
    "roman": "",
    "translation": "O Allah, (bring) beneficial rain clouds.",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 2/518",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 65,
    "type": "Travel",
    "heading": "Supplication for entering the home",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for entering the home",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِّي أَعوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَم، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I misguide others, or I am misguided by others, lest I cause others to err or I am caused to err, lest Iabuse others or be abused, and lest I behave foolishly or meet with the foolishness of others.",
    "refText": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmithi. See also Al-Albani, Sahih At-Tirmithi 3/152 and Sahih Ibn Majah 2/336",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 66,
    "type": "Gratitude",
    "heading": "Supplication After rainfall",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication After rainfall",
    "numOfDuas": 1,
    "arabic": "مُطِرْنا بِفَضْلِ اللهِ وَرَحْمَتِه",
    "roman": "",
    "translation": "It has rained by the bounty of Allah and His mercy",
    "refText": "Al-Bukhari",
    "refType": "Hadith",
    "refChapter": "1/205"
  },
  {
    "id": 67,
    "type": "Protection",
    "heading": "Supplication Asking for clear skies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Asking for clear skies",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ حَوالَيْنا وَلا عَلَيْنا، اللّهُمَّ عَلى الآكامِ وَالظِّراب، وَبُطونِ الأوْدِية، وَمَنابِتِ الشَّجر",
    "roman": "",
    "translation": "O Allah, let it pass us and not fall upon us, but upon the hills and mountains, and the center of the valleys, and upon the forested lands.",
    "refText": "Al-Bukhari 1/224, Muslim 1/614",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 68,
    "type": "Occasion",
    "heading": "Supplication Upon sighting the crescent moon",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Upon sighting the crescent moon",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَر، اللّهُمَّ أَهِلَّهُ عَلَيْنا بِالأمْنِ وَالإيمان، والسَّلامَةِ والإسْلام، وَالتَّوْفيقِ لِما تُحِبُّ رَبَّنا وَتَرْضى، رَبُّنا وَرَبُّكَ الله",
    "roman": "",
    "translation": "Allah is the Most Great . O Allah, bring us the new moon with security and Faith, with peace and in Islam, and in harmony with what our Lord loves and what pleases Him. Our Lord and your Lord is Allah.",
    "refText": "At-Tirmithi 5/504, Ad-Darimi 1/336. See also Al-Albani, Sahih At-Tirmithi 3/157.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 69,
    "type": "Fasting",
    "heading": "Supplication Upon breaking fast",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Upon breaking fast",
    "numOfDuas": 1,
    "arabic": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُروق، وَثَبَتَ الأجْرُ إِنْ شاءَ الله",
    "roman": "",
    "translation": "The thirst is gone, the veins are moistened and the reward is confirmed, if Allah wills.",
    "refText": "Abu Dawud 2/306 and others. See also Al- Albani, Sahihul-Jami' As-Saghir 4/209.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 70,
    "type": "Guidance",
    "heading": "Supplication of the guest for the host",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication of the guest for the host",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ بارِكْ لَهُمْ فيما رَزَقْتَهُم، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ",
    "roman": "",
    "translation": "O Allah, bless them in what You have provided for them, and forgive them and have mercy on them.",
    "refText": "Muslim 3/1615.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 71,
    "type": "Daily",
    "heading": "Supplication said to one offering a drink or to one who intended to do that",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to one offering a drink or to one who intended to do that",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ أَطْعِمْ مَن أَطْعَمَني، وَاسْقِ مَن سقاني",
    "roman": "",
    "translation": "O Allah, feed the one who has fed me and drink to the one who has given me drink.",
    "refText": "Muslim 3/126.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 72,
    "type": "Guidance",
    "heading": "Supplication said upon seeing the early or premature fruit",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said upon seeing the early or premature fruit",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ بارِكْ لَنا في ثَمَرِنا، وَبارِكْ لَنا في مَدينَتِنا، وَبارِكْ لَنا في صاعِنا، وَبارِكْ لَنا في مُدِّنا",
    "roman": "",
    "translation": "O Allah, bless us in our dates and bless us in our town, bless us in our Sa' and in our Mudd.",
    "refText": "Muslim 2/1000 (Sa' and Mudd are both dry measures used for agricultural produce by the Arabs in the Prophet's time. Of the two, the So.'was the larger measure.)",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 73,
    "type": "Gratitude",
    "heading": "Supplication Upon sneezing",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Upon sneezing",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ للهِ",
    "roman": "",
    "translation": "All praises and thanks are to Allah.",
    "refText": "AL-Bukhari  7/125",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 74,
    "type": "Occasion",
    "heading": "Supplication said to the newlywed",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to the newlywed",
    "numOfDuas": 1,
    "arabic": "بارَكَ اللهُ لَك، وَبارَكَ عَلَيْك، وَجَمَعَ بَيْنَكُما في خَيْر",
    "roman": "",
    "translation": "May Allah bless you, and shower His blessings upon you, and join you together in goodness.",
    "refText": "Abu Dawud, Ibn Majah and At-Tirmithi. See also Al-Albani, Sahih At-Tirmithi 1/316.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 75,
    "type": "Occasion",
    "heading": "Supplication The groom's supplication on the wedding night or when buying an animal",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "supplication The groom's supplication on the wedding night or when buying an animal",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنَّي أَسْأَلُكَ خَيْرَها، وَخَيْرَ ما جَبَلْتَها عَلَيْه، وَأَعوذُ بِكَ مِنْ شَرِّها، وَشَرِّ ما جَبَلْتَها عَلَيْه",
    "roman": "",
    "translation": "O Allah, I ask You for the goodness of her and the goodness upon which You have created her, and I seek refuge in You from the evil of her and from the evil upon which You have created her.",
    "refText": "Abu Dawud 2/248 and Ibn Majah 1/617. See also Al-Albani, Sahih Ibn Majah 1/324",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 76,
    "type": "Protection",
    "heading": "Supplication Before sexual intercourse",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "supplication Before sexual intercourse",
    "numOfDuas": 1,
    "arabic": "بِسْمِ الله اللّهُمَّ جَنِّبنا الشَّيْطانَ، وَجَنِّبِ الشَّيْطانَ ما رَزَقْتَنا",
    "roman": "",
    "translation": "With the Name of Allah. O Allah, keep the I Devil away from us and keep the Devil away from that which You provide for us.",
    "refText": "Al-Bukhari 6/141, Muslim 2/1028.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 77,
    "type": "Guidance",
    "heading": "Supplication When angry",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "supplication When angry",
    "numOfDuas": 1,
    "arabic": "أَعوذُ بِاللهِ مِنَ الشَّيْطانِ الرَّجيم",
    "roman": "",
    "translation": "I seek refuge in Allah from Satan the outcast.",
    "refText": "Al-Bukhari 7/99, Muslim 4/2015.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 78,
    "type": "Trials",
    "heading": "Supplication said upon seeing someone in trial or tribulation",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said upon seeing someone in trial or tribulation",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ للهِ الّذي عافاني مِمّا ابْتَلاكَ بِهِ، وَفَضَّلَني عَلى كَثيرٍ مِمَّنْ خَلَقَ تَفْضيلا",
    "roman": "",
    "translation": "Praise is to Allah Who has spared me what He has afflicted you with, and preferred me greatly above much of what He has created.",
    "refText": "At-Tirmithi 5/493,4. See also Al-Albani, Sahih At-Tirmithi 3/153.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 79,
    "type": "Occasion",
    "heading": "Supplication Remembrance said at a sitting or gathering etc.",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Remembrance said at a sitting or gathering etc.",
    "numOfDuas": 1,
    "arabic": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوّابُ الغَفور",
    "roman": "",
    "translation": "My Lord, forgive me and accept my repentance, You are the Ever-Relenting, the All-Forgiving.",
    "refText": "Sahih Ibn Majah 2/321. See also Al-Albani, Sahih At-Tirmithi 3/153.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 80,
    "type": "Occasion",
    "heading": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering etc.",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering etc.",
    "numOfDuas": 1,
    "arabic": "سُبْحانَكَ اللّهُمَّ وَبِحَمدِك، أَشْهَدُ أَنْ لا إِلهَ إِلاّ أَنْتَ أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْك",
    "roman": "",
    "translation": "Glory is to You, O Allah, and praise is to You. I bear witness that there is none worthy of worship but You. I seek Your forgiveness and repent to You.",
    "refText": "See also Ahmad 6/77",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 81,
    "type": "Repentance",
    "heading": "Supplication Returning a supplication of forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Returning a supplication of forgiveness",
    "numOfDuas": 1,
    "arabic": "غَفَرَ اللهُ لَكَ",
    "roman": "",
    "translation": "May Allaah forgive you, O Messenger of Allaah.'",
    "refText": "Ahmad 5/82",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 82,
    "type": "Gratitude",
    "heading": "Supplication said to one who does you a favour",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to one who does you a favour",
    "numOfDuas": 1,
    "arabic": "جَزاكَ اللهُ خَيْراً",
    "roman": "",
    "translation": "May Allah reward you with good.",
    "refText": "At-Tirmithi (no. 2035). See also Al-Albani, Sahih At-Tirmithi 2/200 and Sahihul-Jami' (no. 6244).",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 83,
    "type": "Gratitude",
    "heading": "Supplication said to one who pronounces his love for you, for Allaah's sake",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to one who pronounces his love for you, for Allaah's sake",
    "numOfDuas": 1,
    "arabic": "أَحَبَّكَ الّذي أَحْبَبْتَني لَه",
    "roman": "",
    "translation": "May He for Whose sake you love me, love you.",
    "refText": "Abu Dawud 4/333. Al-Albani graded it good in Sahih Abu Dawud 3/965.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 84,
    "type": "Gratitude",
    "heading": "Supplication What to say upon receiving pleasing or displeasing news",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication What to say upon receiving pleasing or displeasing news",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ للهِ الَّذي بِنعْمَتِهِ تَتِمُّ الصّالِحات",
    "roman": "",
    "translation": "Praise is to Allah Who by His blessings all good things are perfected.",
    "refText": "Ibn As-Sunni, 'Amalul-Yawm wal-Laylah, and Al-Hakim who graded it authentic 1/499. See also Al-Albani, Sahihul-Jami' As-Saghir 4/201.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 85,
    "type": "Repentance",
    "heading": "Supplication said for one you have insulted",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said for one you have insulted",
    "numOfDuas": 1,
    "arabic": "اللهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لهُ قُرْبةً إليكَ يَوْمَ القِيَامةِ",
    "roman": "",
    "translation": "O Allah, whomever of the believers I have abused, give him the reward of a sacrificial slaughter for it on the Day of Resurrection.",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/171, Muslim 4/2007. The wording in Muslim's report is: 'make it a purification for him and a source of mercy.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 86,
    "type": "Daily",
    "heading": "Supplication What to say when startled",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication What to say when startled",
    "numOfDuas": 1,
    "arabic": "لا إلهَ إلاّ اللهُ",
    "roman": "",
    "translation": "There is none worthy of worship but Allah!",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 6/181, Muslim 4/2208.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 87,
    "type": "Fasting",
    "heading": "Supplication For Iftaar Fasting",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication For Iftaar Fasting",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ",
    "roman": "",
    "translation": "O Allah, I fasted for You and broke my fast with Your provisions.",
    "refText": "Sunan Abu Dawood 2358",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 88,
    "type": "Daily",
    "heading": "Dua for Rizq",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for Rizq",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
    "roman": "",
    "translation": "O Allah, I ask You for beneficial knowledge, goodly provision and acceptable deeds",
    "refText": "Sunan Ibn Majah 925",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 89,
    "type": "Guidance",
    "heading": "Hajat ki Dua/Dua e Hajat in Arabic",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Hajat ki Dua/Dua e Hajat in Arabic",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ، سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ، الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ،أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ،وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ،لَا تَدَعْ لِي ذَنْبًا إِلَّا غَفَرْتَهُ،وَلَا هَمًّا إِلَّا فَرَّجْتَهُ،وَلَا حَاجَةً هِيَ لَكَ رِضًا إِلَّا قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِينَ",
    "roman": "",
    "translation": "None has the right to be worshiped but Allah. Al-Halim (the Forbearing) Al-Karim (the Generous). Glorious is Allah, Lord of the Magnificent Throne. All praise is due to Allah, Lord of the worlds. I ask You for that which warrants Your mercy, and that which will determine Your forgiveness, and the spoils (fruits) of every righteous deed, and safety from every sin; do not leave a sin for me without forgiving it, nor a worry without relieving it. Or a need that pleases you without granting it. O Most-Merciful of those who have mercy.",
    "refText": "Jami at Tirmidhi 479",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 90,
    "type": "Prayer",
    "heading": "Dua after Azan",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua after Azan",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "roman": "",
    "translation": "O Allah! Lord of this perfect call and of the regular prayer which is going to be established, give Muhammad(ﷺ) the authority of intercession and illustriousness, and raise him to the greatest and highest position in Paradise that You promised him.",
    "refText": "Sahih Bukhari 614",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 91,
    "type": "Guidance",
    "heading": "What is said to a kaafir when he sneezes",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "What is said to a kaafir when he sneezes",
    "numOfDuas": 1,
    "arabic": "يَهْديكُمُ اللهُ وَيُصْلِحُ بالَكُم",
    "roman": "",
    "translation": "May Allah guide you and set your affairs in order.",
    "refText": "At-Tirmithi 5/82, Ahmad 4/400, Abu Dawud 4/ 308. See also Al-Albani, Sahih At-Tirmithi 2/354.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 92,
    "type": "Daily",
    "heading": "Returning a greeting to a kaafir",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Returning a greeting to a kaafir",
    "numOfDuas": 1,
    "arabic": "وَعَلَيْكُمْ",
    "roman": "",
    "translation": "And upon you.",
    "refText": "Al-Bukhari,",
    "refType": "Hadith",
    "refChapter": "Al-Asqalani, Fathul-Bari 11/42, Muslim 4/1705."
  },
  {
    "id": 93,
    "type": "Fasting",
    "heading": "When insulted while fasting",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When insulted while fasting",
    "numOfDuas": 1,
    "arabic": "إنِّي صَائِمٌ , إنِّي صَائِمٌ",
    "roman": "",
    "translation": "I am fasting . I am fasting.",
    "refText": "Al-Bukhari,",
    "refType": "Hadith",
    "refChapter": "Al-Asqalani, Fathul-BAri 4/103, Muslim 2/806."
  },
  {
    "id": 94,
    "type": "Guidance",
    "heading": "When slaughtering or offering a sacrifice",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When slaughtering or offering a sacrifice",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ واللهُ أَكْبَرُ اللَّهُمَّ مِنْكَ ولَكَ اللَّهُمَّ تَقَبَّلْ مِنِّي",
    "roman": "",
    "translation": "With the Name of Allah, Allah is the Most Great! [O Allah, from You and to You.] O Allah, accept it from me.",
    "refText": "Muslim 3/",
    "refType": "Hadith",
    "refChapter": "1557, Al-Bayhaqi 9/287."
  },
  {
    "id": 95,
    "type": "Illness",
    "heading": "When visiting the sick",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When visiting the sick",
    "numOfDuas": 1,
    "arabic": "أَسْأَلُ اللهَ العَظيم، رَبَّ العَرْشِ العَظيم أَنْ يَشْفيك. (سبع مرات)",
    "roman": "",
    "translation": "I ask Almighty Allah, Lord of the Magnificent Throne, to make you well. (Recite seven times in Arabic.",
    "refText": "At-Tirmithi, Abu Dawud. See also Al-Albani, Sahih At-Tirmithi 2/210 and Sahihul-Jami' As-Saghir 5/180.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 96,
    "type": "Illness",
    "heading": "Supplication of the sick who have renounced all hope of life",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication of the sick who have renounced all hope of life",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ اغْفِرْ لي وَارْحَمْني وَأَلْحِقْني بِالرَّفيقِ الأَعْلى",
    "roman": "",
    "translation": "O Allah, forgive me and have mercy upon me and join me with the highest companions (in Paradise).",
    "refText": "Al-Bukhari,",
    "refType": "Hadith",
    "refChapter": "Al-Asqalani, Fathul-Bari 8/144."
  },
  {
    "id": 97,
    "type": "Illness",
    "heading": "Instruction for the one nearing death",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Instruction for the one nearing death",
    "numOfDuas": 1,
    "arabic": "لا إلهَ إلاّ الله",
    "roman": "",
    "translation": "There is none worthy of worship but Allah. ... will enter Paradise.",
    "refText": "Abu Dawud",
    "refType": "Hadith",
    "refChapter": "3/190. See also Al-Albani, Sahihul-Jami' As-Saghir 5/432."
  },
  {
    "id": 98,
    "type": "Guidance",
    "heading": "Supplication for one afflicted by a calamity",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for one afflicted by a calamity",
    "numOfDuas": 1,
    "arabic": "إِنّا للهِ وَإِنَا إِلَيْهِ راجِعون، اللهُمِّ أجُرْني في مُصيبَتي، وَاخْلِفْ لي خَيْراً مِنْها",
    "roman": "",
    "translation": "We are from Allah and unto Him we return . O Allah take me out of my plight and bring to me after it something better.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "2/632."
  },
  {
    "id": 99,
    "type": "Prayer",
    "heading": "When closing the eyes of the deceased",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When closing the eyes of the deceased",
    "numOfDuas": 1,
    "arabic": "اللهُمِّ اغْفِرْ لِ-فلان باسمه- وَارْفَعْ دَرَجَتَهُ في المَهْدِيين، وَاخْلُفْهُ في عَقِبِهِ في الغابِرين، وَاغْفِرْ لَنا وَلَهُ يا رَبَّ العالَمين، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْلَهُ فيه",
    "roman": "",
    "translation": "O Allah, forgive [name of the person] and elevate his station among those who are guided. Send him along the path of those who came before, and forgive us and him, O Lord of the worlds. Enlarge for him his grave and shed light upon him in it.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "2/634"
  },
  {
    "id": 100,
    "type": "Prayer",
    "heading": "Supplication for the deceased at the funeral prayer",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for the deceased at the funeral prayer",
    "numOfDuas": 1,
    "arabic": "اللهُمِّ عَبْدُكَ وَابْنُ أَمَتِك، احْتاجَ إِلى رَحْمَتِك، وَأَنْتَ غَنِيٌّ عَنْ عَذابِه، إِنْ كانَ مُحْسِناً فَزِدْ في حَسَناتِه، وَإِنْ كانَ مُسيئاً فَتَجاوَزْ عَنْه",
    "roman": "",
    "translation": "O Allah, Your male slave and the child of Your female slave is in need of Your mercy , and You are not in need of his torment . If he was pious then increase his rewards and if he was a transgressor then pardon him .. [4]",
    "refText": "Al-Hakim",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 101,
    "type": "Protection",
    "heading": "Placing children under Allaah's protection",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Placing children under Allaah's protection",
    "numOfDuas": 1,
    "arabic": "أُعيذُكُما بِكَلِماتِ اللهِ التّامَة، مِنْ كُلِّ شَيْطانٍ وَهامَّة، وَمِنْ كُلِّ عَيْزٍ لامَّة",
    "roman": "",
    "translation": "I seek protection for you in the Perfect Words of Allah from every devil and every beast, and from every envious blameworthy eye.",
    "refText": "Al-Bukhari",
    "refType": "Hadith",
    "refChapter": "4/119"
  },
  {
    "id": 102,
    "type": "Protection",
    "heading": "To ward off the deception of the obstinate Shaytaans",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "To ward off the deception of the obstinate Shaytaans",
    "numOfDuas": 1,
    "arabic": "أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُ هُنَّ بَرُّ ولَا فَاجرُ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّمَا\nيَنْزِلُ مِنَ السَّمَاءِ وِمنْ شَرِّ مَا يَعْرُ جُ فيهَا، ومِن شَرِّ مَا ذَرَأَ في الأَرْضِ ومِنْ شَرِّ مَا يَخْرُ جُ مِنْهَا، وِمنْ شَرِّ فِتَنِ\nاللَّيْلِ والنَّهارِ، ومِنْ شَرِّ كُلِّ طارِقٍ إِلَّا طَارٍقاً يَطْرُقُ بخَيْرٍ يَارَحْمَنُ",
    "roman": "",
    "translation": "I take refuge within Allaah's perfect words which no righteous or unrighteous person can transgress, from all the evil that He has created,\nmade and originated. [I take refuge] from the evil that descends from the sky and the evil that rises up to it. [I take refuge] from the evil that\nis spread on earth and the evil that springs from her, and I take refuge from the evil of the tribulations of night and day, and the evil of one\nwho visits at night except the one who brings good, O Merciful One.'",
    "refText": "Ahmad 3/419, with an authentic chain of narration, and Ibn As-Sunni (no. 637).\nAl-'Aqidah At-Tahawiyyah p. 133. See also Majma'uz-Zawa'id, 10/127.\n\nAl-Arna'ut, graded its chain authentic in his checking of",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 103,
    "type": "Daily",
    "heading": "The best dua",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The best dua",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "roman": "",
    "translation": "Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!",
    "refText": "Quran 2:201",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 104,
    "type": "Daily",
    "heading": "Dua for knowledge, provision and good deeds",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for knowledge, provision and good deeds",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّاِنِّى أَسْألُكَ عِلْمَاً نَافِعاً وَرِزْقاً طَيِباً وَعَمَلاً مُتَقَبَلاً",
    "roman": "",
    "translation": "O Allah! I ask You for knowledge that is of benefit, a good provision and deeds that will be accepted.",
    "refText": "[lbn Majah and others]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 105,
    "type": "Protection",
    "heading": "Protection from distress, hardships, calamities",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Protection from distress, hardships, calamities",
    "numOfDuas": 1,
    "arabic": "اللَّهُمّ إِنِّي أَعُوذُبِكَ مِنْ جَهْدِ الْبَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ",
    "roman": "",
    "translation": "O Allah I seek refuge in YOU from severe calamities and hardships, grips of ill hope, evil destiny and from rejoicing of enemies",
    "refText": "Bukhari",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 106,
    "type": "Daily",
    "heading": "Dua for wellness in both worlds",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for wellness in both worlds",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ إِنِيْ أَسْأَلُكَ العَافِيَةَ فِيّ الْدُّنْيَاوَ الْآخِرَةِ",
    "roman": "",
    "translation": "O Allah I ask You wellness in this life and in the hereafter",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 107,
    "type": "Protection",
    "heading": "Dua for protection from any harm, and cure from illness [3 times]",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for protection from any harm, and cure from illness [3 times]",
    "numOfDuas": 1,
    "arabic": "أَعُوذُ بِكَلِمَاتِ الله التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "roman": "",
    "translation": "I seek protection in the perfect words of Allah from every evil that He has created.",
    "refText": "Aboo Hurayrah (may Allah be pleased with him) narrates from the Prophet : \"Whoever recites in the evening three times; I seek protection in the perfect words of Allah from every evil that He has created, then not so much as a stinger (humah) will harm him that evening.\" In Muslim there is a similar wording without mention of reciting the supplication thrice (#2709) and at-Tirmidhee (#3898), and al-'Alaamah Ibn Baaz (may Allah have\nmercy upon him) mentioned it in Tuhfat-ul-Akhyaar, saying: \"The noun al-Humah denotes an animal that possess a stinger filled with poison like a scorpion,\nsnake or something similar. And Suhayl bin Saalih who is one of the narrators of this narration said: \"Our people had learned this supplication and we used\nto recite it every evening when a teenage girl was stung but suffered no pain or affliction (from the sting)\". Taken from The Precious Remembrance Written\nby ash-Shaykh Ibn 'Uthaymeen",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 108,
    "type": "Protection",
    "heading": "Daily Azkar for protection from any unexpected affliction [recite 3 times]",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Daily Azkar for protection from any unexpected affliction [recite 3 times]",
    "numOfDuas": 1,
    "arabic": "بِسْمِ الله الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْئُ فِي الأَرْضِ وَلاَ فِي السَماءِوَهُوَ السَّمِيِعُ العَلِيمُ",
    "roman": "",
    "translation": "In the name of Allah, with Whose name nothing on the earth or in the heavens can cause harm, He is the All-Hearing, the All-Knowing",
    "refText": "Related by Aboo Daawud (#5088) from 'Uthmaan bin 'Afaan (may Allah be pleased with him), and its wording is: I heard the Messenger\nof Allah say: \"Whoever says three times; In the name of Allah, with Whose Name nothing on the earth or in the heavens can cause harm, He is the All-\nHearing, the All-Knowing, he will not be afflicted with an unexpected affliction until he reaches the morning, and whoever recites it three times upon\nentering the morning he will not be afflicted with an unexpected affliction until he reaches the evening.\" Shaykh al-Albaanee (may Allah have mercy upon\nhim) authenticated it in Saheeh Abee Daawud (#5088). And it was narrated by Abaan bin 'Uthmaan said: I heard 'Uthmaan bin 'Afaan (may Allah be pleased\nwith him) said: The Messenger of Allah said: \"There is not a slave who recites three times in the morning of every day and in the evening of every night; In\nthe name of Allah, with Whose name nothing on the earth or in the heavens can cause harm, He is the All-Hearing, the All-Knowing, and have anything harm\nhim.\" And Abaan had been afflicted with a bout of paralysis when a man began staring at him so Abaan said to him,\" What are you staring at? Did I not\ninform you of the narration however I had not recited the supplication the day Allah carried out over me what is from His Divine Decree?\" Related by\natTirmidhee (#3388) and Ibn Maajah (#3869), at-Tirmidhee said: It is Hasan Saheeh and al-'Alaamah Ibn Baaz (may Allah have mercy upon him) agreed with\nits grade in Tuhfat-ul-Akhyaar",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 109,
    "type": "Wellness",
    "heading": "Dua for wellness in family & property",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for wellness in family & property",
    "numOfDuas": 1,
    "arabic": "اللّهُمَ اِتِّي أسْألُكَ الْعَفْوَوَ العَافِيَةَ فِى الدُّنْيَا وَالآ خِرَةِ، اللّهمَ إِّي أسْألُكَ الْعَقْوَ وَالعَافِيَةَ فِي دِيْنِي وَدُنْيَايَ وَأهْلِي\nومَالِيا للْهُمَّاسْتُرُ عَوْرَاتِيوَآمِنْ رَوْعَاتِيا للْهُمَّآحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ\nشِمَالِيوَ مِنْ فَوْقِي وَأعُوْذُ بِعَظْمَتِكَ أنْ أغْتَالَ مِنْ تَحْتِي",
    "roman": "",
    "translation": "O Allah I ask You Pardon and wellness in this life and in the hereafter, O Allah I ask You pardon and wellness in my religion, life, family and\nproperty, O Allah hide my mistakes and make my fears peaceful. O Allah protect what is between my hands, what is behind me, what is on\nmy right and what is on my left, what is above me, and I seek protection in Your Magnificence that I am consumed by what is underneath\nme.",
    "refText": "Related by Imaam Ahmad as #4785, Aboo Daawud as #5074 and alHaakim authenticated it in his Mustadrak as #1945 and al-'Alaamah Ibn Baaz may",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 110,
    "type": "Protection",
    "heading": "Daily Dua for protection",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Daily Dua for protection",
    "numOfDuas": 1,
    "arabic": "اللَّهُمّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكهُ، أَشْهَدُ أَنْلَا إِلَهَ إِلَّا أَنْتَ،\nأَعُوذُبِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْ كِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
    "roman": "",
    "translation": "O Allaah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that\nnone has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and\nfrom committing wrong against my soul or bringing such upon another Muslim.",
    "refText": "Related by Ahmad (#51, #63, #81, and #7961), al-Bukhaaree in (alAdabul-Mufrad) (#1202, #1204), and in the narrative of Imaam Ahmad #7961 from him\nwhere he said in the last part of the narration: \" ... Say it when you have entered upon morning and when you have entered upon the evening, and when you\ntake to your bed.\" And it was authenticated by al- 'Alaamah Ibn Baaz-may Allah have mercy upon him-in Tuhfat-ul-Akhyaar. Taken from The Precious\nRemembrance Written by ash-Shaykh Ibn 'Uthaymeen",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 111,
    "type": "Protection",
    "heading": "Morning dua for protection from jinn/shaytan for the entire day [recite 100 times]",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Morning dua for protection from jinn/shaytan for the entire day [recite 100 times]",
    "numOfDuas": 1,
    "arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُلاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِیرُ",
    "roman": "",
    "translation": "None has the right to be worshipped except Allaah, alone, without any partner. To Him belong all sovereignty and praise and He is over all\nthings omnipotent.",
    "refText": "It was narrated from Abu Hurayrah that the Messenger of Allaah (peace and blessings of Allaah be upon him) said: \"Whoever says [ this dua ] one hundred\ntimes in the day, will have a reward equivalent to that of freeing ten slaves, one hundred hasanahs (good deeds) will be recorded for him, and one hundred\nsayi'ahs (bad deeds) will be erased from his record, and *it will be protection for him from the Shaytaan for that day*, until evening comes. No one could\nachieve any better than him except the one who does more than he did.\" [Ref: narrated by al-Bukhaari, 31119; Muslim, 2691]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 112,
    "type": "Protection",
    "heading": "Dua against every kind of harm/evil.",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua against every kind of harm/evil.",
    "numOfDuas": 1,
    "arabic": "حَسْبِيَ اللهُلَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "roman": "",
    "translation": "Allaah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne.",
    "refText": "[Sunan Abu Dawud, Hadith No. 5081, Hassan] from hisnulmuslim.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 113,
    "type": "Provision/ Wealth",
    "heading": "Supplications for provision / wealth",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplications for provision / wealth",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ اكفِنِي بِحَلالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "roman": "",
    "translation": "O Allah, suffice me with what You have allowed instead of what You have forbidden, and make me independent of all others besides You.",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 114,
    "type": "Protection",
    "heading": "Seeking refuge from seven calamities",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking refuge from seven calamities",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ إِذِى أعُوذُبِكَ مِنَ التَّرَدَى، وَالْهَدْمِ، وَالْغَرَقِنوَ الْحَرِى قِنوَاْ عُوذُبِكَ أنْ ىَ مَخَتَّطَنِىَ الشَّى طَانُ عِنْدَ\nالْمَوْتِ، وَأعُوذُبِكَ أنْ أمُوتَ فِى سَبى ِلمكَ مُدْبِراً، وَأعُوذُبِكَ أنْ أمُوتَ لَدِى خاً",
    "roman": "",
    "translation": "O Allaah, I seek refuge with You from falling from a high place, and from being crushed by a falling building, and from drowning, and from\nbeing burned to death, and I seek refuge with You from being overcome by Satan at the point of death, and I seek refuge with You from\ndying in Your cause whilst fleeing away, and I seek refuge with You from dying from a poisonous sting'.",
    "refText": "Imaam an-Nasaa.ee-rahimahullaah- reported in his 'Sunan' [The Book of Seeking Refuge: Chapter 61: Seeking refuge from falling from a high place, and\nfrom being crushed by a falling building] (no. 5531): \"Mahmood ibn Ghaylaan related to us, saying: al-Fadl ibn Moosaa narrated to us: from `Abdullaah ibn\nSa`eed: from Sayfee, the freed slave of Aboo Ayyoob: from Abul-Yasar, who said: Allaah's Messenger (Peace be upon him) used to say: [this dua]. Also\nreported by Aboo Daawood [The Book of Prayer: Chapter 367: With regard to seeking refuge: (no.1552)]. Declared 'Saheeh' by Shaikh al-Albaanee -\nrahimahullaah.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 115,
    "type": "Guidance",
    "heading": "Asking Allah for good deeds, and no tests",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking Allah for good deeds, and no tests",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّاِّي أَسأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِى، وَتَرْ حَمَنِي، وَإِذَا أَرَدْتَ\nفِتْنَةَ قَوْمٍ فَتَوَقَّنِي غَيرَ مَفْنُونٍ، وَأَسْأَلُكَ حُبَّكَ، وَحُتَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّ بُنِي إِلَى حُبِّكَ",
    "roman": "",
    "translation": "O Allaah, I ask You to grant me the performance of good deeds, abandonment of bad ones, and love of the poor; and (I ask You) that You\nforgive me and have mercy upon me; and if You intend to try a people, cause me to die without being tested; and I ask You for Your love, and\nthe love of those who love you, and the love of actions which draw me closer to Your love.",
    "refText": "Ahmad 5/243, Al-Haakim 1/521 and At-Tirmidhi 5/369 (with similar wording); declared hasan by At-Tirmidhi who said, \"I asked Muhammad bin Isma'il (Al-\nBukhari) and he said, \"This hadith is hasan sahih.\" Additionally, at the end of the hadith, the Prophet alag dale alll La said, \"Verily it is true so learn it and\nteach it.\"\" Source: From the Book \"Supplications & Treatment with Ruqyah\", Dr. Sa'eed bin Ali Al-Qahtani, Dar-us-Salam Publication",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 116,
    "type": "Guidance",
    "heading": "Seeking refuge from weaknesses & sadness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking refuge from weaknesses & sadness",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِّي أَعْوذُبِكَ مِنَ الهَمِّ وَالْحَزَنِ، والعجْرِ والكَسَلِ والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ\nالرِّجال",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from | being\novercome by debt and from being overpowered by men (i .e. other people).[2]",
    "refText": "",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 117,
    "type": "Daily",
    "heading": "Duas for good character & personality traits",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas for good character & personality traits",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ فَاَيّمَامُؤْ مِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ",
    "roman": "",
    "translation": "O Allah! If I should ever abuse a believer, please let that be a means of bringing him near to You on the Day of Resurrection.",
    "refText": "[1] Narrated Abu Huraira: that he heard the Prophet (s) saying, \"O Allah! If I should ever abuse a believer, please let that be a means of bringing him near to\nYou on the Day of Resurrection.\" Reference: Sahih al-Bukhari 6361 (Book 80, Hadith 58). Translated by Dr. Muhammad Muhsin Khan",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 118,
    "type": "Protection",
    "heading": "Seeking refuge from declining of favours and punishments",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking refuge from declining of favours and punishments",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَميع سَخَطِكَ",
    "roman": "",
    "translation": "O Allah! I seek refuge in You against the declining of Your Favours, passing of safety, the suddenness of Your punishment and all that which\ndispleases You).",
    "refText": ".((رواه مسلم)).[used to supplicate thus: [this dua صلى الله عليه وآله وسلم Abdullah",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 119,
    "type": "Guidance",
    "heading": "Duas for guidance & uprightness in religion",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas for guidance & uprightness in religion",
    "numOfDuas": 1,
    "arabic": "الَّهُمَّإِي أَعُوذُبِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I misguide others, or I am misguided by others, lest I cause others to err or I am caused to err, lest I abuse\nothers or be abused, and lest I behave foolishly or meet with the foolishness of others.",
    "refText": "[1]Umm Salamah رضى الله عنها said, \"Never did the Prophet صلى الله عليه وسلم leave my house without looking towards heaven, supplicating: [this dua]. \" [Abu\nDawud, Ibn Majah, An-Nasa'i, At-Tirmithi.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 120,
    "type": "Provision/ Wealth",
    "heading": "Dua for increase & blessing in wealth and offspring",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for increase & blessing in wealth and offspring",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ أكْثِرْ مَالِى، وَوَلَدِى، وَبَارِكْلِى فِى مَا أعْطَى تَنِى وَأطِلْ حَىَ اذِى عَلَى طَاعَتِكَ، وَأحْسِنُ عَمَدِى\nوَاغْفِرْلِى",
    "roman": "",
    "translation": "O Allah, increase my wealth and offspring, and bless me in what You have given me [1] [and direct my life to Your obedience and rectify my\nactions] and forgive my sins [2]",
    "refText": "[1] Al Bukhari 7/54 and Muslim 4/1928. It is indicative of the supplicaation offered by the Prophet for Anas bin Malik where he stated \"O Allah, increase his\nwealth and offspring and bless him in what you have given him.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 121,
    "type": "Daily",
    "heading": "A comprehensive dua",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "A comprehensive dua",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ إِنِي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَابِمَ مَغْفِرَتِكَ،\nوَأَسْأَلُكَ شُكْرَ نِعْمَنِكَ، وَحُسْنَ عِبَادَتِكَ، وَأَسْأَلُكَ قَلْبَاً سَلِيمَاً، وَلِسَانَاً صَادِقَاً، وَأَسْأَلُكَ مِنْ خَيْرِْ مَا تَعْلَمُ،\nوَأَعُوذُبِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أنْتَ عَلاَّمُ الْغُيُوبِ",
    "roman": "",
    "translation": "O Allaah verily I ask of You for strength of perseverance of obedience on the Deen, and determination in practicing of the Deen and\ngoodness. And I ask of You for that which obligates Your mercy and resolutions for Your forgiveness. And I ask of You for the capability to\nbe thankful for Your blessings and to worship you in a correct and good way. And I ask of You for a heart which is purified in belief and free\nfrom desires and a truthful tongue. And ask of You for the best of what You know, and I seek refuge with You from the evil of what You know\nand I seek forgiveness for that which You know. Indeed You are the One who knows the unseen.",
    "refText": "Collected by Tabraani in 'Mu'ajam al-Kabeer' (7/335-336), Abu Na'eem in 'al-Hileeyah' (1/266), Ibn Aasakir in 'Tareekh Damishk'. Albaani said this Isnaad is\nJayyid, in 'Silsilah Saheehah' No. 3228.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 122,
    "type": "Illness",
    "heading": "Dua for healing and good health",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for healing and good health",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ ربَّ النَّاسِ، أَذْهِب الْبَأسَ، واشْفِ، أَنْتَ الشَّافي لا شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفاءَ لا يُغَادِرُ سقَماً",
    "roman": "",
    "translation": "O Allaah, Lord of mankind, do away with my suffering. Heal (me) as You are the only Healer and there is no cure except that of Yours, it is\nthat which leaves no ailment behind",
    "refText": "(Al Bukhari (with Al-Fath 10/206) and Muslim 4/1721) Source: From the Book \"Supplications & Treatment with Ruqyah (Pocket size)\" - Dr. Sa'eed bin Ali Al-\nQahtani - Dar-us-Salam Publication",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 123,
    "type": "Guidance",
    "heading": "Duas for paradise and refuge from hellfire",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas for paradise and refuge from hellfire",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ إِّي أَسْأَلُكَ الْجَنَّةَ، وَمَا قَزَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُبِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ\nعَمَلٍ",
    "roman": "",
    "translation": "O Allaah, I ask of You for Paradise and that which brings me closer to it of statements or actions. And I seek refuge with You from the\nHellfire and that which takes me closer to it of statements or actions.",
    "refText": "Authenticated by Albaani in Saheeh Ibn Majah 2/327",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 124,
    "type": "Guidance",
    "heading": "Dua for a submissive heart and satisfied soul, and answered prayers",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for a submissive heart and satisfied soul, and answered prayers",
    "numOfDuas": 1,
    "arabic": "اللَّهُمّ إِنِّي أَعُوذُبِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لا يَخْشَعُ وَمِنْ نَفْسِ لَا تَشْبَعُ وَمِنْ دَعْوَةِلَا يُسْتَجَابُ لَهَا",
    "roman": "",
    "translation": "O Allah, I seek refuge with You from knowledge that does not benefit, from a heart that is not humbly submissive; from a soul that is never\nsatisfied, and from a supplication that is not given a response.",
    "refText": "[Sunan al-Nasa'ī 5537, Graded Sahīh by Al-Albānī]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 125,
    "type": "Guidance",
    "heading": "Seeking refuge with Allah from evil people around you",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking refuge with Allah from evil people around you",
    "numOfDuas": 1,
    "arabic": "اللهَمَّ إِّي أَعُوْذُبِكَ مِنْ جَارِ السُّوءِ، وَمِنْ زَوْج تَشَتِّبَنِي قَبْلَ الْمَشِيْبِ، وَمِنْ وَلَدٍ يَكُونُ عَلَيَّرَبَاً، وَمِنْ مَالِ\nيَكُونُ عَلَيَّ عَذَاباً،وَمِنْ خَلِيْلٍ مَاكِرِ عَيِنُهُ تَرَانِيٍ، وَقَلْبُهُ يَرعَانِي؛ إنْ رَأَى حَسَنَةً دَفَنَهَا، وَإذَارَأَى سَيِّنَةً\nأَذَاعَهَا",
    "roman": "",
    "translation": "Oh Allaah, I seek refuge with you from an evil neighbour; and from a wife who causes me to grow old before old age; and from a son who will\nbecome a master over me; and from wealth which will become a punishment for me; and from a cunning friend whose gaze is upon me &\nwhose heart is plotting & planning against me, such that if he sees something good, he buries it & if he sees something bad he spreads it.",
    "refText": "Abu Hurayrah (radee'Allaahu anhu) said that from his (Messenger of Allaah, sallAllaahu alayhee wa aalehee wasalam) supplications were [this dua]\n(Collected by At Tabaraani in 'Ad Dua' (3/1425/1339) and its chain is declared 'Jayyid' (Good) by Shaikh Al Albaani in silsilatul Ahaadeethus Saheehah\n(No#3137)",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 126,
    "type": "Protection",
    "heading": "Dua for protection from harm/jinn/shayateen",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for protection from harm/jinn/shayateen",
    "numOfDuas": 1,
    "arabic": "أَعُوذُ بكَلِمَاتِ اللهِالتَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّبَرُّ ولَا فَاجرُ مِنْ شَرِّ مَاخَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّمَا\nيَنْزِلُ مِنَ السَّمَاءِ وِمنْ شَرِّ مَا يَعْرُ جُ فيهَا، ومِن شَرِّ مَا ذَرَأَ في الأَرْضِ ومِنْ شَرِّ مَا يَخْرُ جُ مِنْهَا، وِمنْ شَرِّ فِتَنِ\nاللَّيْلِ والنَّهارِ،ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارٍ قاً يَطْرُقُ بخَيْرٍ يَارَحْمَنُ",
    "roman": "",
    "translation": "I take refuge within Allaah's perfect words which no righteous or unrighteous person can transgress, from all the evil that He has created,\nmade and originated. [I take refuge] from the evil that descends from the sky and the evil that rises up to it. [I take refuge] from the evil that\nis spread on earth and the evil that springs from her, and I take refuge from the evil of the tribulations of night and day, and the evil of one\nwho visits at night except the one who brings good, O Merciful One.'",
    "refText": "Ja'far bin Sulaymaan ad-Duba'ee narrated: Aboo at-Tayyaaj narrated to us, he said: \"I said to 'Abdur-Rahmaan bin Khanbash at-Tameemee - and he was an\nold man - 'did you reach the Messenger of Allaah alu9 dule alll Lo (during his lifetime)?' He said, 'Yes.' He said: 'So I said: How did the Messenger of\nAllaah ol9 dle alll gLo act on the night the shayaateen plotted against him?' So he said: 'Indeed the shayaateen descended that night upon the Messenger\nof Allaah ola9 dile alll Lo from the valleys and mountain paths, and amongst them was a shaytaan, in his hand was a flame of fire, wanting to burn the face",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 127,
    "type": "Trials",
    "heading": "Anxiety and sorrow",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Anxiety and sorrow",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِّي أَعْوذُبِكَ مِنَ الهَمِّ وَالْحَزَنِ، والعَجْزِ والكَسَلِ والبُخْلِ والجُبِْنِ، وضَلْعِ الدَّيْنِ وغَلَبَةِ\nالرِّجال",
    "roman": "",
    "translation": "O Allah, I seek refuge in you from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being\novercome by debt and overpowered by men (i .e . others).",
    "refText": "Al-Bukhari\n\n7/158. See also Al-Asqalani, Fathul-Bari 11/173",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 128,
    "type": "Trials",
    "heading": "Supplication for one in distress",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for one in distress",
    "numOfDuas": 1,
    "arabic": "لا إِلهَ إِلا آنَت سُبْحانَك إِني كنّتَ مِنَ الظالِمين",
    "roman": "",
    "translation": "There is none worthy of worship but You, glory is to You. Surely, I was among the wrongdoers.[3]",
    "refText": "At-Tirmithi 5/529. Al-Hakim declared it authentic and Ath-Thahabi agreed with him 1/ 505. See also Al-Albani, Sahih At-Tirmithi 3/168.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 129,
    "type": "Trials",
    "heading": "Upon encountering an enemy or those of authority",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Upon encountering an enemy or those of authority",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ أَنْتَ عَضُدي، وَأَنْتَ نَصيري، بِكَ أَجولُ وَبِكَ أَصولُ وَبِكَ أُقاتِل",
    "roman": "",
    "translation": "O Allah, You are my strength and You are my support. For Your sake I go forth and for Your sake I advance and for Your sake I fight.",
    "refText": "Abu Dawud 2/89, and Al-Hakim graded it authentic and Ath-Thahabi agreed 2/142",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 130,
    "type": "Trials",
    "heading": "Supplication for one afflicted with doubt in his faith",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for one afflicted with doubt in his faith",
    "numOfDuas": 1,
    "arabic": "هُوَ الأوَّلُ، وَالآخِرُ، وَالظّاهِرُ، وَالْباطِنُ، وَهُوَ بِكُلِّ شَيءٍ عَليم",
    "roman": "",
    "translation": "He is the First and the Last, the Most High and the Most Near. And He is the Knower of all things.",
    "refText": "Hadid 57:3; Abu Dawud 4/329. Declared hasan by Al-Albaanee and al-Arna'uut",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 131,
    "type": "Trials",
    "heading": "Settling a debt",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Settling a debt",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِنِي أَعْوذُبِكَ مِنَ الهَمِّ وَالْحَزَنِ، والعَجْزِ والكَسَلِ والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ\nالرِّجال",
    "roman": "",
    "translation": "O Allah, I seek refuge in You from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from | being\novercome by debt and from being overpowered by men (i .e. other people).[2]",
    "refText": "Al-Bukhaaree 7/157",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 132,
    "type": "Prayer",
    "heading": "Supplication for a child in the funeral prayer",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for a child in the funeral prayer",
    "numOfDuas": 1,
    "arabic": "اللهُمِّ اجْعَلْهُ لَنا فَرَطاً، وَسَلَفاً وَأَجْراً",
    "roman": "",
    "translation": "O Allah, make him for us a precursor, a forerunner and a cause of reward.",
    "refText": "Ibn Qudamah, Al-Mughni 3/416 and Ad-Duroosul-Muhimmah li-Aammatil-'Ummah, pg. 15, by Shaikh 'Abdul-'Aziz bin Baz.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 133,
    "type": "Condolence",
    "heading": "Supplication Condolence",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication Condolence",
    "numOfDuas": 1,
    "arabic": "أَعْظَمَ اللهُ أَجْرَكَ، وَأَحْسَنَ عَزاءَ كَ، وَغَفَرَ لِمَيِّتِكَ",
    "roman": "",
    "translation": "May Allah magnify your reward, and make perfect your bereavement, and forgive your departed[2]",
    "refText": "Al-Bukhari 2/80, Muslim 2/636.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 134,
    "type": "Guidance",
    "heading": "Visiting the graves",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Visiting the graves",
    "numOfDuas": 1,
    "arabic": "العافِيَة",
    "roman": "",
    "translation": "Peace be upon you, people of this abode, from among the believers and those who are Muslims, and we, by the Will of Allah, shall be\njoining you . [May Allah have mercy on the first of us and the last of us] I ask Allah to grant us and you strength.",
    "refText": "Muslim 2/671, Ibn Majah 1/494, the portion brackets is from Muslim 2/671.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 135,
    "type": "Guidance",
    "heading": "What to say and do when feeling some pain in the body",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "What to say and do when feeling some pain in the body",
    "numOfDuas": 1,
    "arabic": "أَعُوذُ باللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
    "roman": "",
    "translation": "I seek refuge in Allah and in His Power from the evil of what I find and of what I guard against.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "4/1728."
  },
  {
    "id": 136,
    "type": "Protection",
    "heading": "The last 3 Surahs of the Quran",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "The last 3 Surahs of the Quran",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ﴾ قُلْ هُوَ اللهُ أَحَدٌ ﴾ اللهُ الصَّمَدُ ﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًّا أَحَدٌهه",
    "roman": "",
    "translation": "With the Name of Allah, the Most Gracious, the Most Merciful. Say: He is Allah (the) One. The Self-Sufficient Master, Whom all creatures\nneed, He begets not nor was He begotten, and there is none equal to Him. [Surah Ikhlas]",
    "refText": "",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 136,
    "type": "Protection",
    "heading": "The last 3 Surahs of the Quran",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "The last 3 Surahs of the Quran",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. ﴾ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴾ مِنْ شَرِّ مَا خَلَقَ ﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴾ وَمِنْ شَرِّ\nالتَّفَّاثَاتِ فِي الْعُقَدِ ﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾ه",
    "roman": "",
    "translation": "With the Name of Allah, the Most Gracious, the Most Merciful. Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what\nHe has created, and from the evil of the darkening (night) as it comes with its darkness, and from the evil of those who practice witchcraft\nwhen they blow in the knots, and from the evil of the envier when he envies. [Surah Falaq]",
    "refText": "",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 136,
    "type": "Protection",
    "heading": "The last 3 Surahs of the Quran",
    "totalCount": 3,
    "numSubCategories": 0,
    "subHeading": "The last 3 Surahs of the Quran",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ. ﴾ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴾ مَلِكِ النَّاسِ ﴾ إِلَهِ النَّاسِ ﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ\n﴿ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴾ مِنَ الْجِنَّةِ وَالنَّاسِ",
    "roman": "",
    "translation": "With the Name of Allah, the Most Gracious, the Most Merciful. Say: I seek refuge with (Allah) the Lord of mankind, the King of mankind,\nthe God of mankind, from the evil of the whisperer who withdraws, who whispers in the breasts of mankind, of jinns and men.[Surah Naas]",
    "refText": "",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 137,
    "type": "Travel",
    "heading": "When mounting an animal or any means of transport",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When mounting an animal or any means of transport",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللهِ وَالْحَمْدُ لله، سُبْحانَ الّذي سَخَّرَ لَنا هذا وَما كُنّا لَهُ مُقْرِنين، وَإِنّا إِلى رَبِّنا لَمُنقَلِبون، الحَمْدُ لله،\nالحَمْدُ لله، الحَمْدُ لله، اللهُ أكْبَر، اللهُ أكْبَر، اللهُ أكْبَر، سُبْحانَكَ اللّهُمَّ إِنِّي ظَلَمْتُ نَفْسي فَاغْفِرْ لي، فَإِنَّهُ لا\nيَغْفِرُ الذُّنوبَ إِلّ أَنْت",
    "roman": "",
    "translation": "With the Name of Allah . Praise is to Allah . Glory is to Him Who has provided this for us though we could never have had it by our efforts.\nSurely, unto our Lord we are returning. Praise is to Allah. Praise is to Allah. Praise is to Allah. Allah is the Most Great. Allah is the Most\nGreat. Allah is the Most Great. Glory is to You. O Allah, I have wronged my own soul. Forgive me, for surely none forgives sins but You.",
    "refText": "Abu Dawud 3/34, At-Tirmithi 5/501. See also Al-Albani, Sahih At-Tirmithi 3/156.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 138,
    "type": "Travel",
    "heading": "Supplication for travel",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication for travel",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَرُ، اللّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللَّهُمَّ إِنَّا\nنَسْأَلُكَ فِي سَفْرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفْرِنَا هَذَا وَاطْوَعَتَا بَعْدهُ، اللَّهُمَّ\nأَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْتَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءٍ\nالمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ",
    "roman": "",
    "translation": "Allah is the Most Great. Allah is the Most Great. Allah is the Most Great. Glory is to Him Who has provided this for us though we could never\nhave had it by our efforts. Surely, unto our Lord we are returning. O Allah, we ask You on this our journey for goodness and piety, and for\nworks that are pleasing to You . O Allah, lighten this journey for us and make its distance easy for us . O Allah, You are our Companion on\nthe road and the One in Whose care we leave our family . O Allah, I seek refuge in You from this journey's hardships, and from the wicked\nsights in store and from finding our family and property in misfortune upon returning.",
    "refText": "",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 138,
    "type": "Travel",
    "heading": "Supplication for travel",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Supplication for travel",
    "numOfDuas": 1,
    "arabic": "آيِبُونَ تَائْبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ",
    "roman": "",
    "translation": "We return repentant to our Lord, worshipping our Lord, and praising our Lord.",
    "refText": "Muslim 2/978.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 139,
    "type": "Travel",
    "heading": "Supplication upon entering a town or village etc.",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication upon entering a town or village etc.",
    "numOfDuas": 1,
    "arabic": "الرِّياحِ وَما ذَرَيْن، أَسْأَّلُكَ خَيْرَ هذهِ الْقَرْيَةِ وَخَيْرَ أَهْلِها، وَخَيْرَ ما فيها، وَأَعوذُ بِكَ مِنْ شَرِّها وَشَرِّ أَهْلِها، وَشَرِّ\nما فيها",
    "roman": "",
    "translation": "O Allah, Lord of the seven heavens and all they overshadow, Lord of the seven worlds and all they uphold, Lord of the devils and all they lead\nastray, Lord of the winds and all they scatter. I ask You for the goodness of this town and for the goodness of its people, and for the\ngoodness it contains. I seek refuge in You from its evil, from the evil of its people and from the evil it contains.",
    "refText": "Al-Hakim who graded it authentic and Ath-Tfaahabi agreed 2/100, and Ibn As-Sunni (no. 524). Al-Hafidh graded it good in his checking of\nAl-'Athkdr 5/154. Ibn Baz said in Tuhfatul-'Akhydr p. 37, that An-Nasa'i recorded it with a good chain of narration.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 140,
    "type": "Travel",
    "heading": "Supplication of the resident for the traveller",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication of the resident for the traveller",
    "numOfDuas": 1,
    "arabic": "زَوَّدَكَ اللهُ التقْوى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُما كُنْت",
    "roman": "",
    "translation": "May Allah give you piety as your provision, forgive your sins, and make goodness easy for you wherever you are.",
    "refText": "At-Tirmithi.\n\nSee Al-Albani, Sahih At-Tirmithi, 3/155.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 141,
    "type": "Travel",
    "heading": "Remembrance while ascending or descending",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Remembrance while ascending or descending",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَر",
    "roman": "",
    "translation": "Allah is the Most Great",
    "refText": "Al-Bukhari,",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 141,
    "type": "Travel",
    "heading": "Remembrance while ascending or descending",
    "totalCount": 2,
    "numSubCategories": 0,
    "subHeading": "Remembrance while ascending or descending",
    "numOfDuas": 1,
    "arabic": "سُبْحانَ الله",
    "roman": "",
    "translation": "Glory is to Allah.",
    "refText": "",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 142,
    "type": "Travel",
    "heading": "Prayer of the traveller as dawn approaches",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Prayer of the traveller as dawn approaches",
    "numOfDuas": 1,
    "arabic": "سَمِعَ سامِعُ بِحَمْدِ اللهِ وَحُسْنِ بَلائِهِ عَلَيْنا. رَبَّنا صاحِبْنا وَأَفْضِل عَلَيْنا عائِذاً باللهِ مِنَ النّار",
    "roman": "",
    "translation": "He Who listens has heard that we praise Allah for the good things He gives us. Our Lord, be with us and bestow Your favor upon us. I seek\nthe protection of Allah from the Fire.",
    "refText": "the meaning of sami'a saami'un (who listens has heard) is that 'a witness has witnessed our praise of Allah due to His\nblessings and favor upon us.' It could also be read samma'a saami'un, in which case it means 'one who has heard this statement of mine will convey it\nto another and he will say it as well.' This is due to the attention given to the Thikr (remembrance of Allah) and supplications made during the early\nmorning hours. The meaning of his saying 'Our Lord, be with us and\nYour numerous bounties, and avert from us every evil.' See An-Nawawi, .\n\nbestow Your favor upon us' is: 'Our Lord, protect us and guard us. Bless us with",
    "refType": "Hadith",
    "refChapter": "Sharh Sahih Muslim 17/39."
  },
  {
    "id": 143,
    "type": "Travel",
    "heading": "Stopping or lodging somewhere",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Stopping or lodging somewhere",
    "numOfDuas": 1,
    "arabic": "أَعوذُ بِكَلِماتِ اللهِ التّامّاتِ مِنْ شَرِّ ما خَلَق",
    "roman": "",
    "translation": "I seek refuge in the Perfect Words of Allah from the evil of what He has created.",
    "refText": "Muslim",
    "refType": "Hadith",
    "refChapter": "4/2080."
  },
  {
    "id": 144,
    "type": "Travel",
    "heading": "While returning from travel",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "While returning from travel",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَر، اللهُ أَكْبَر، اللهُ أَكْبَر لا إلهَ إلّّ اللهُ وَحْدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ\nقَدير، آيِبونَ تائِبونَ عابِدونَ لِرَبِّنا حامِدون، صَدَقَ اللهُ وَعْدَه، وَنَصَرَ عَبْدَه، وَهَزَمَ الأَحْرابَ وَحْدَه",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, Who has no partner . His is the dominion and His is the praise, and He is Able to do all\nthings. We return repentant to our Lord, worshipping our Lord, and praising our Lord . He fulfilled His Promise, He aided His slave, and He\nalone defeated the Confederates.",
    "refText": "Bukhari 7/163, Muslim 2/980. The Prophet (SAW) used to say this when returning f\nfrom a campaign or from Hajj.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 145,
    "type": "Trials, Provision/ Wealth",
    "heading": "Supplication for one afflicted by whisperings in prayer or recitation",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for one afflicted by whisperings in prayer or recitation",
    "numOfDuas": 1,
    "arabic": "أَعوذُ بِاللهِ مِنَ الشَّيْطانِ الرَّجيم",
    "roman": "",
    "translation": "I seek refuge in God from the accursed Satan",
    "refText": "Muslim\n\n4/1729",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 146,
    "type": "Trials",
    "heading": "Supplication for one whose affairs have become difficult",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for one whose affairs have become difficult",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ لا سَهْلَ إِلاّ ما جَعَلتَهُ سَهلاً، وَأَنْتَ تَجْعَلُ الْحَزَنَ إِذا شِئْتَ سَهتلاً",
    "roman": "",
    "translation": "O Allah, there is no ease other than what You make easy. If You please You ease sorrow.",
    "refText": "Ibn Hibban in his\nby\n\nاللّهُمَّ لا سَهْلَ إِلاّ ما جَعَلتَهُ سَهلاً، وَأَنْتَ تَجْعَلُ الْحَزَنَ إِذا شِئْتَ سَهتلاً\n\nAllaahumma laa sahla 'illaa maa ja'altahu sahlan wa 'Anta taj'alul-hazna 'idhaa shi'ta sahlan.\n\n139. O Allah, there is no ease other than what You make easy. If You please You ease sorrow.\n\nSahih (no. 2427), and Ibn As- Sunni (no. 351). Al-Hafidh (Ibn Hajar)\n'Abdul-Qadir Al-Arna'ut in his checking of An-Nawawi's Kitabul-Athkarp.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 147,
    "type": "Trials",
    "heading": "Supplications for expelling the devil and his whisperings",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplications for expelling the devil and his whisperings",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلََّّ اللّهُ وَحْدَةُلَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُوَهُوَ عَلَى كُلِّ شَيْءِقَدِرُ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all\nthings.",
    "refText": "Abu Dawud 1/206, At-Tirmithi. See also Al-Albani, Sahih At-Tirmithi 1/77, and Surat Al-Mu'minun, 23:98-9.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 148,
    "type": "Trials",
    "heading": "When stricken with a mishap or overtaken by an affair",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When stricken with a mishap or overtaken by an affair",
    "numOfDuas": 1,
    "arabic": "قَدَّرَ اللهُ وَما شاءَ فَعَل",
    "roman": "",
    "translation": "It is the Decree of Allah and He does whatever He wills.",
    "refText": "Muslim\n[2] Abu Daawud and see: checking of Zaad Al-Ma'aad, Pg. 106",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 149,
    "type": "Trials",
    "heading": "Supplication said to the debtor when his debt is settled",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said to the debtor when his debt is settled",
    "numOfDuas": 1,
    "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّما جَزاءُ السَّلَفِ الْحَمْدُ والأَداء",
    "roman": "",
    "translation": "May Allah bless you in your family and your wealth, surely the reward for a loan is praise and returning (what was borrowed).",
    "refText": "An-Nasa'i, 'Amalul-Yawm wal-Laylahp. 300, Ibn Majah 2/809. See also Al-Albani, Sahih Ibn Majah2/55.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 150,
    "type": "Trials",
    "heading": "Supplication for fear of shirk",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication for fear of shirk",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ إِني أَعوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنا أَعْلَمْ، وَأَسْتَغْفِرُكَلِما لا أَعْلَم",
    "roman": "",
    "translation": "O Allah, I seek refuge in You lest I associate anything with You knowingly, and I seek Your forgiveness for what I know not.",
    "refText": "Ahmad\n\nV\n\n4/403. See also Al-Albani, Sahihul-Jami' As-Saghir 3/233 and\n\nSahihut-Targhib wat- Tarhib 1/19.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 151,
    "type": "Trials",
    "heading": "Forbiddance of ascribing things to omens",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Forbiddance of ascribing things to omens",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ لا طَيْرَ إِلاّ طَيْرُك، وَلا خَيْرَ إِلاّ خَيْرُك، وَلا إِلهَ غَيْرُك",
    "roman": "",
    "translation": "O Allah there is no portent other than Your portent, no goodness other than Your goodness, and none worthy of worship other than You.",
    "refText": "Ahmad 2/220, Ibn As-Sunni (no. 292). See also Al-Albani, Silsilatul-'Ahadlth As-Sahihah 3/54, (no. 1065). As for bodings of good, these used to please the Prophet (SAW) and so when he heard good words from someone,he used to say: \"We have taken from you a good portent from your mouth,\"Abu Dawud, Ahmad. See also Al-Albani, Silsilatul-'Ahadith As-Sahihah 2/363, and it is with Abu Ash-Shaikh Al-Asfahani in 'Akhlaqun-Nabiyy,pg. 270.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 152,
    "type": "Trials",
    "heading": "What to say upon receiving pleasing or displeasing news",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "What to say upon receiving pleasing or displeasing news",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ للهِالَّذي بِنِعْمَتِهِ تَتِمُّ الصّالِحات",
    "roman": "",
    "translation": "Praise is to Allah Who by His blessings all good things are perfected .",
    "refText": "Ibn As-Sunni, 'Amalul-Yawm wal-Laylah, and Al-Hakim who graded it authentic 1/499.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 153,
    "type": "Trials",
    "heading": "Supplication made against an enemy",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication made against an enemy",
    "numOfDuas": 1,
    "arabic": "اللَّهُمّ مُنْزِلَ الِكتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الإحْزَابَ، اللَّهُمَّاِهْزِ مُهُمْ وَزَلْزِلْهُم",
    "roman": "",
    "translation": "Allah, Revealer of the Book, Swift to account, defeat the groups (of disbelievers) . O Allah, defeat them and shake them.",
    "refText": "Muslim\n\n3/1362.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 154,
    "type": "Trials",
    "heading": "What to say when in fear of a people",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "What to say when in fear of a people",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّاكْفِنِِهِمْ بِماَشِئْتَ",
    "roman": "",
    "translation": "O Allah, suffice (i.e. protect) me against them however You wish.",
    "refText": "Muslim 4/2300.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 155,
    "type": "Trials",
    "heading": "What to say when in fear of afflicting something or someone with one's eye",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "What to say when in fear of afflicting something or someone with one's eye",
    "numOfDuas": 1,
    "arabic": "اللّهُمَّ بارِك عَلَيه. ماشاءَ الله، لا قُوَّةَ إلاّ بالله",
    "roman": "",
    "translation": "O Allah send blessings upon him<br><br>(This is) that which Allah has willed, there is no power except with Allah.",
    "refText": "Ahmad 4/447, Ibn Majah, Malik. Al-Albani graded it authentic in Sahihul-Jami' As-Saghir 1/212. Also see Al-Arna'ut's checking of Ibn Al-Qayyim's Zadul-Ma'ad 4/170.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 156,
    "type": "Trials",
    "heading": "Asking for patience, strength & victory over enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for patience, strength & victory over enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَفْرِعْ عَلَيْنَا صَبْراً وَثَبِتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Pour forth on us patience, set our feet firm and make us victorious over the disbelieving people.",
    "refText": "Quran 2:250",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 157,
    "type": "Trials",
    "heading": "Asking for ease when facing any hardship - grief/ stress/ trouble from enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for ease when facing any hardship - grief/ stress/ trouble from enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَالَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا\nوَلَا تُحَمِّلْنَا مَالَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْ حَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ\nالْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Punish us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us (Jews\nand Christlans); our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forglveness. Have mercy on\nus. You are our Maula (Patron, Suppor-ter and Protector, etc.) and give us victory over the disbelleving people.",
    "refText": "Quran 2:286",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 158,
    "type": "Azkar",
    "heading": "Seeking forgiveness and repentance",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking forgiveness and repentance",
    "numOfDuas": 1,
    "arabic": "أَسْتَغْفِرُ اللهَ الَّذِي لَا إِلَهَ إلَّاّ هُوَ الحَيُّ القَيّوُمُ وأَتُوبُ إِلَيهِ",
    "roman": "",
    "translation": "I seek Allaah's forgiveness, besides whom, none has the right to be worshipped except He, The Ever Living, The Self-Subsisting and\nSupporter of all, and I turn to Him in repentance.'\n... Allaah would forgive him even if he was one who fled during the advance of an army.'",
    "refText": "Abu Dawud 2/85, At-Tirmithi 5/569, and Al-Hakim who declared it authentic and Ath-Thahabi agreed with him 1/511. Al-Albani graded it\nauthentic in Sahih At-Tirmithi",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 159,
    "type": "Azkar",
    "heading": "The Best Dua for forgiveness - Sayyidul Istaghfar",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The Best Dua for forgiveness - Sayyidul Istaghfar",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا\nصَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "roman": "",
    "translation": "O Allah, You are my Lord, there is no god but You. You have created me and I am Your slave. And I am keeping my promise and covenant to\nYou as much as I can. I seek refuge with You from the evil of what I do. I acknowledge Your blessing and I acknowledge my sin, so forgive\nme, for there is none who can forgive sin except You).",
    "refText": "He (sallallahu alaihi wasallam) said, 'Whoever says these words during the day, believing in it firmly, and dies on that day before evening comes, he will be\none of the people of Paradise. And whoever says it at night, believing firmly in it, and dies before morning comes, he will be one of the people of Paradise.'\n[Saheeh al-Bukhaari (6306)]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 160,
    "type": "Azkar",
    "heading": "Duas for Forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas for Forgiveness",
    "numOfDuas": 1,
    "arabic": "أَسْتَغْفِرُ اللهَ الْعَظِيمَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ وَ أَتُوبُ إِلَيْهِ",
    "roman": "",
    "translation": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, The Living, The Eternal, and I repent unto Him",
    "refText": "A person who says [the words of this dua] even if he has committed sins as much as the the foam of an ocean, still he will be forgiven. [Abu Dawud-\n2:85/ Tirmidhi 5:569]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 161,
    "type": "Azkar",
    "heading": "Dua for forgiveness, paradise and refuge from hellfire",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for forgiveness, paradise and refuge from hellfire",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ أَوَلَهُ وَآخِرَهُ سِرَّهُ وَعَلانِيَتَهُ اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ، وَأَعُوذُ بِكَ مِنْ\nسَخَطِكَ وَالنَّارِ",
    "roman": "",
    "translation": "O Allaah forgive all my sins, the minute of them and the major of them, the first of them and the last of them, the ones committed secretly\nand openly. O Allaah, I ask of Your pleasure and for Paradise, and I seek refuge from Your displeasure and from the Hellfire.",
    "refText": "[Collected by Muslim]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 162,
    "type": "Azkar",
    "heading": "Dhikr",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dhikr",
    "numOfDuas": 1,
    "arabic": "أَعُوذُ بِعِزَّتِكَ الَّذِي لاَ إِلَهَ إِلاَّ أَنْتَ، الَّذِي لاَ يَمُوتُ وَالْجِنُّ وَالإِنْسُ يَمُوتُونَ",
    "roman": "",
    "translation": "I seek refuge (with You) by Your Izzat (Honour, Power and Glory) Laa ilaaha illa Anta, (none has the right to be worshipped but You), Who\ndoes not die while the jinns and the human beings die.",
    "refText": "Sahih al-Bukhari 7383 (Book 97, Hadith 13)\nTranslated by Dr. Muhammad Muhsin Khan",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 163,
    "type": "Azkar",
    "heading": "Dua for Allah's mercy and forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for Allah's mercy and forgiveness",
    "numOfDuas": 1,
    "arabic": "اللهم إنِّي أسْأَلُكَ موجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلامَةَ مِنْ كُلِّ إِثْمٍ، وَالْغَنِيْمَةَ مِنْ كُلِّ بِرِّ، وَالْفَوزَ بِالْجَنَّةِ،\nوَالنَّجَاةَ مِنَ النَّارِ",
    "roman": "",
    "translation": "O Allah! I beg You for that which incites Your Mercy and the means of Your forgiveness, safety from every sin, the benefit from every good\ndeed, success in attaining Jannah and deliverance from Fire)",
    "refText": "[Al-Hakim]. [Riyadh as Saliheen Book 17 Hadith 1493]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 164,
    "type": "Azkar",
    "heading": "The last 2 ayahs of Surah Baqarah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The last 2 ayahs of Surah Baqarah",
    "numOfDuas": 1,
    "arabic": "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ\nوَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴾ لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا\nاكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا\nتُحَمِّلْنَا مَا لَا طَاقَةً لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوؤْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "The Messenger believes in what has been send down to him from his Lord, and so do the believers. Each one believes in Allah, His Angels,\nHis Books, and His Messengers. They say: \"We make no distinction between any of His Messengers,\" and they say: \"We hear, and we obey.\n(We seek) Your Forgiveness, our Lord, and to You is the return.\" Allah burdens not a person beyond what he can bear. He gets reward for that\n(good) which he has earned, and he is punished for that (evil) which he has earned. Our Lord! Punish us not if we forget or fall into error. Our\nLord! Lay not on us a burden like that which You did lay on those before us. Our Lord! Put not on us a burden greater than we have strength\nto bear. Pardon us and grant us forgiveness. Have mercy on us. You are our Protector, and help us against the disbelieving people.",
    "refText": "The Prophet pl9 adle alll „Lo said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\" [Ref: Sahih al-Bukhari\n5009]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 165,
    "type": "Hajj/ Umrah",
    "heading": "Supplication said between the Yemeni corner and the black stone [at the Ka'bah]",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Supplication said between the Yemeni corner and the black stone [at the Ka'bah]",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آتِنَا في الدُّنْيَا حسَنَةً وفي الآخِرَةِ حسَنةً وقِنَا عذَابَ النَّارِ",
    "roman": "",
    "translation": "Our Lord, grant us the good things in this world and the good things in the next life and save us from the punishment of the Fire.",
    "refText": "Abu Dawud 2/179, Ahmad 3/411, Al-Baghawi, Sharhus-Sunnah 7/128. Al-Albani graded\nSurat Al-Baqarah, 2:201.\n\n»\n\nit good in Sahih Abu Dawud 1/354. The Ayat is from",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 166,
    "type": "Trials",
    "heading": "Asking for strength & victory over disbelievers",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for strength & victory over disbelievers",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَ إِسْرَافَنَا في أَمْرِ نَاوَ ثَبِتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the\ndisbelleving folk.",
    "refText": "Quran 3:147",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 167,
    "type": "Trials",
    "heading": "Asking for protection from enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for protection from enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَالاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ: وَنَجِنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Make us not a trial for the folk who are Zalimun (polytheists and wrong-doing) (i.e. do not make them overpower us). And save us\nby Your Mercy from the disbelieving folk.",
    "refText": "Quran 10:85-86",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 168,
    "type": "Hajj/ Umrah",
    "heading": "The Day of 'Arafah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The Day of 'Arafah",
    "numOfDuas": 1,
    "arabic": "لا إِلَهَ إلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ عَلَى كُلِّ شَيْءٍ قَديرٌ.",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all\nthings.",
    "refText": "At-Tirmithi. Al-Albani graded it good in Sahih At-Tirmithi 3/184, and also\n\nSilsilatul-'Ahadith As-Sahihah 4/6.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 169,
    "type": "Trials",
    "heading": "Dua for mercy and ease from hardship/grief/stress/trouble",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for mercy and ease from hardship/grief/stress/trouble",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِ نَارَشَدًا",
    "roman": "",
    "translation": "Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way",
    "refText": "Quran 18:10",
    "refType": "quran",
    "refChapter": ""
  },
  {
    "id": 170,
    "type": "Hajj/ Umrah",
    "heading": "When throwing each pebble at the Jamaraat",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When throwing each pebble at the Jamaraat",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبرُ!",
    "roman": "",
    "translation": "Allah is the Most Great.",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 3/581, 3, 4, and Muslim",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 171,
    "type": "Hajj/ Umrah",
    "heading": "At the black stone",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the black stone",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَرُ",
    "roman": "",
    "translation": "Allah is the Most Great!",
    "refText": "Al-Bukhari, ,cf. Al-Asqalani, Fathul-Bari 3/476. See also 472. The 'something' that was referred to in this Hadith was a cane.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 172,
    "type": "Trials",
    "heading": "Dua for ease in religion, life & hereafter",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for ease in religion, life & hereafter",
    "numOfDuas": 1,
    "arabic": "اللهم أَصْلِحْ لي دِيّْنِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِى آخِرَبِيِ الَّتِي\nفِيهَا مَعَادِي، وَاجعَلِ الْحَيَاةَزِ يَادَةً لي فِي كُلِّ خَيْر، وَاجعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
    "roman": "",
    "translation": "O Allah, make my rellglon easy for me by virtue of which my affalrs are protected, set right for me my world where my life exlsts, make good\nfor me my Hereafter which Is my resort to which I have to return, and make my IIfe prone to perform all types of good, and make death a\ncomfort for me from every evil",
    "refText": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah () used to say: [this dua] [Muslim] [Riyad as Saliheen Book 17, Hadith 1472]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 173,
    "type": "Trials",
    "heading": "Refuge from the enemies, from worriment & fright",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Refuge from the enemies, from worriment & fright",
    "numOfDuas": 1,
    "arabic": "أَعوذُبِكَلِماتِ اللّهِ التّامّاتِ مِن غَضَبِهِ وَعِقابِهِ، وَشَرِّ عِبادِهِوَ مِنْ هَمَزاتِ الشَّياطينِ وَأَنْ\nيَحْضرون",
    "roman": "",
    "translation": "I seek refuge in the Perfect Words of Allah from His anger and His punishment, from the evil of His slaves and from the taunts of devils and\nfrom thelr presence.",
    "refText": "[Muwatta Maalik, Book 51, Hadith 9]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 174,
    "type": "Trials",
    "heading": "Dua of Yunus alayhissalam for seeking Allah's help",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua of Yunus alayhissalam for seeking Allah's help",
    "numOfDuas": 1,
    "arabic": "لاَ إله إلاَّ أنت سُبْحنَكَ إِنِّ كُنْتُ مِنَ الظَّلِمِين",
    "roman": "",
    "translation": "There is none worthy of worship but You, glory is to You. Surely, I was among the wrongdoers.[3]",
    "refText": "[Qur'an Al Ambiya 21:87]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 175,
    "type": "Hajj/ Umrah",
    "heading": "The Talbiyah for Hajj or 'Umrah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The Talbiyah for Hajj or 'Umrah",
    "numOfDuas": 1,
    "arabic": "لَبَّيْكَ اللَّهُمَّ لَتَّيْكَ، لَبَّيْكَ لا شَرِيكَ لَكَ لَبَّيْكَ، إنَّ الْحَمْدَ، وَالنِّعْمَةَ ،لَكَ وَالْمُلْكُ، لا شَرِيِكَ لَكَ",
    "roman": "",
    "translation": "I am here at Your service, O Allah, I am here at Your service. I am here at Your service, You have no partner, I am here at Your service .\nSurely the praise, and blessings are Yours, and the dominion . You have no partner.",
    "refText": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 3/408, Muslim 2/841.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 176,
    "type": "Trials",
    "heading": "Duas from Quran for protection against enemy",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas from Quran for protection against enemy",
    "numOfDuas": 1,
    "arabic": "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
    "roman": "",
    "translation": "My Lord! deliver me from the unjust people",
    "refText": "Qur'an Al Ankaboot 29:30",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 177,
    "type": "Trials",
    "heading": "Duas to be said when fearing injustice or attack from authority / ruler",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas to be said when fearing injustice or attack from authority / ruler",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّرَبَّ السَّمَاوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لي جَاراً مِن (إسمُه) وَأَحْزَابِهِ مِنْ خَلاَبِقِكَ، أَن يَفْرُطَ\nعَلَيَ أَحَدُّ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ وَجَلَّ ثَنَائُكَ، وَلَا إِلَهَ إِلَّاَ أَنْتَ",
    "roman": "",
    "translation": "O Allah, Lord of the Seven heavens, Lord of the Magnificent Throne, be for me a support against (say the person's name) and his helpers\nfrom among your creatures, lest any of them abuse me or do me wrong. Mighty is Your patronage and glorious are Your praises. There is\nnone worthy of worship but You.",
    "refText": "[2] Ibn 'Abbas said, \"When you go to an awesome ruler and fear that he will attack you, say, [this dua] three times. [Ref: Al-Bukhari, Al-'Adab Al-Mufrad (no.\n708). Al-Albani graded it authentic in Sahih Al-'Adab Al-Mufrad (no. 546).]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 178,
    "type": "Trials",
    "heading": "Bedtime dua for refuge from the devil, persistent bad dreams / nightmares etc",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Bedtime dua for refuge from the devil, persistent bad dreams / nightmares etc",
    "numOfDuas": 1,
    "arabic": "بِسْمِ اللَّهِوَضَعْتُ جَنْبِي اللَّهُمَ اغْفِرْلِي ذَنْبِي وَأَخْسِئْ شَيْطَانِي وَفُكَ رِ هَانِي وَاجْعَلْنِي فِي النَّدِيِّ الأَعْلَى",
    "roman": "",
    "translation": "in the name of Allah, I have laid down my side for Allah. O Allah! forgive me my sin, drive away my devil, free me from my responsibility, and\nplace me In the highest assembly.",
    "refText": "Abu Dawud said: Abu Hammam al-Ahwazi transmitted it from Thawr. He mentioned Abu Zuhair al-Anmari (instead of Abu al-Azhar). Sahih (Al-Albani).\nSunan Abl Dawud 5054",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 179,
    "type": "Trials",
    "heading": "Dua for troubled times",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for troubled times",
    "numOfDuas": 1,
    "arabic": "لاَ إِلَهَ إِلاَّ اللَهُ العَظِيمُ الْحَلِيمُ لا إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ لاَ إِلَهَ إِلَّ اللَّهُرَبُّ السَّمَوَاتِ وَرَبُّ الأَرْضِ وَرَبُّ\nالْعَرْشِ الْكَرِيمِ",
    "roman": "",
    "translation": "There Is no god but Allah, the Great, the Tolerant, there Is no god but Allah, the Lord of the Magnificent Throne There Is no god but Allah, the\nLord of the Heaven and the earth, the Lord of the Edifying Throne.",
    "refText": "Book 35, Hadith 6583. [New Book Ref Book 48, Hadith 114]",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 180,
    "type": "Quranic",
    "heading": "Dua from Quran #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #1",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ العَلِيمُ رَبَنَا وَاجْعَلْنَا مُسْلِمَيْنٍ لَكَ وَمِنْ ذُرِّ يَّتِنَا أُمَّةًَ مُسْلِمَةً لَكَ وَأَرِنَا\nمَنَاسِكَنَا وَتُبْ عَلَيْنَاً إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ.",
    "roman": "",
    "translation": "Our Lord! Accept (this service) from us. Verily! You are the All-Hearer, the All-Knower. Our Lord! And make us submissive unto You and of\nour offspring a nation submissive unto You, and show us our Manasik (all the ceremonies of pilgrimage - Hajj and 'Umrah, etc.), and accept\nour repentance. Truly, You are the One Who accepts repentance, the Most Merciful. (Al-Baqarah 2:127,128)",
    "refText": "Quran 2:127,128",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 181,
    "type": "Quranic",
    "heading": "Dua from Quran #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #2",
    "numOfDuas": 1,
    "arabic": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ",
    "roman": "",
    "translation": "O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I\nwould indeed be one of the losers.",
    "refText": "Quran 11:47",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 182,
    "type": "Quranic",
    "heading": "Dua from Quran #3: The best dua",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #3: The best dua",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "roman": "",
    "translation": "Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire! (Al-\nBaqarah 2:201)",
    "refText": "Quran 2:201",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 183,
    "type": "Quranic",
    "heading": "Dua from Quran #4: Asking for patience, strength & victory over enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #4: Asking for patience, strength & victory over enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَتَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Pour forth on us patience, set our feet firm and make us victorious over the disbelieving people. [2:250]",
    "refText": "Quran 2:250",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 184,
    "type": "Quranic",
    "heading": "Dua from Quran #5: Asking for ease when facing any hardship - grief/ stress/ trouble from enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #5: Asking for ease when facing any hardship - grief/ stress/ trouble from enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَالَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًّا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا\nوَلَا تُحَمِّلْنَا مَالَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْ حَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ\nالْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Punish us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us (Jews\nand Christlans); our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forglveness. Have mercy on\nus. You are our Maula (Patron, Suppor-ter and Protector, etc.) and give us victory over the disbelleving people. [2:286]",
    "refText": "Quran 2:286",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 185,
    "type": "Quranic",
    "heading": "Dua from Quran #6",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #6",
    "numOfDuas": 1,
    "arabic": "رَبَّنَالَاتُزِعْ قُلُوبَنَا بَعْدَ إِذْهَدَ يْتَنَاوَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ",
    "roman": "",
    "translation": "Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.",
    "refText": "Quran 3:8",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 186,
    "type": "Quranic",
    "heading": "Dua from Quran #7",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #7",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمِ لَا رَيْبَ فِيهِ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
    "roman": "",
    "translation": "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily, Allah never breaks His\nPromise\\. (Aali Imran 3:9)",
    "refText": "Quran 3:9",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 187,
    "type": "Quranic",
    "heading": "Dua from Quran #8: Forgiveness and refuge from hellfire",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #8: Forgiveness and refuge from hellfire",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا إِنَّنَا آمَنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
    "roman": "",
    "translation": "Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire.",
    "refText": "Quran 3:16",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 188,
    "type": "Quranic",
    "heading": "Dua from Quran #9",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #9",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
    "roman": "",
    "translation": "Our Lord! We believe in what You have sent down, and we follow the Messenger ['lesa (Jesus)]; so write us down among those who bear\nwitness (to the truth i.e. La ilaha ill-Allah - none has the right to be worshipped but Allah). (Aali Imran 3:53)",
    "refText": "Quran 3:53",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 189,
    "type": "Quranic",
    "heading": "Dua from Quran #10: Asking for strength & victory over disbelievers",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #10: Asking for strength & victory over disbelievers",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَاوَ إِسْرَافَنَا فِي أَمْرِ نَاوَ ثَبِتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the\ndisbelleving folk.",
    "refText": "Quran 3:147",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 190,
    "type": "Quranic",
    "heading": "Dua from Quran #11",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #11",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا مَا خَلَقْتَ هُذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
    "roman": "",
    "translation": "Our Lord! You have not created (all) this without purpose, glory to You! (Exalted be You above all that they associate with You as partners).\nGlve us salvatlon from the torment of the Fire.",
    "refText": "Quran 3:191",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 191,
    "type": "Quranic",
    "heading": "Dua from Quran #12",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #12",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنًّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَقَّنَا مَعَ\n\nالْأَبْرَارِ",
    "roman": "",
    "translation": "Our Lord! Verily, we have heard the call of one (Muhammad SAW) calling to Faith: 'Believe in your Lord, and we have believed. Our Lord!\nForgive us our sins and remit from us our evil deeds, and make us die in the state of righteousness along with Al-Abrar (those who are\nobedient to Allah and follow strictly His Orders).[3:193]",
    "refText": "Quran 3:193",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 192,
    "type": "Quranic",
    "heading": "Dua from Quran #13",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #13",
    "numOfDuas": 1,
    "arabic": "رَبَّنَاوَ آتِنَامَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا نُخْلِفُ الْمِيعَادَ",
    "roman": "",
    "translation": "Our Lord! Grant us what You promised unto us through Your Messengers and disgrace us not on the Day of Resurrection, for You never\nbreak (Your) Promlse.",
    "refText": "Quran 3:194",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 193,
    "type": "Quranic",
    "heading": "Dua from Quran #14",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #14",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آمَنَافَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
    "roman": "",
    "translation": "Our Lord! We believe; so write us down among the witnesses.",
    "refText": "Quran 5:83",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 194,
    "type": "Quranic",
    "heading": "Dua from Quran #15",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #15",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَنْزِلْ عَلَيْنَا مَائِدَةً مِنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِأَوَّلِنَا وَآخِرِنَا وَآيَةً مِنْكَ وَارْزُقْنَا وَأَنْتَ خَيْرُ الرَّازِقِينَ",
    "roman": "",
    "translation": "Our Lord! Send us from heaven a table spread (with food) that there may be for us - for the first and the last of us - a festival and a sign from\nYou; and provide us sustenance, for You are the Best of sustainers. [5:114]",
    "refText": "Quran 5:114",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 195,
    "type": "Quranic",
    "heading": "Dua from Quran #16: Adam alayhissalam's dua for forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #16: Adam alayhissalam's dua for forgiveness",
    "numOfDuas": 1,
    "arabic": "رَبَّنَاظَلَمْنَا أَنْفُسَنَا وَ إِنْ لَمْ تَغْفِرْ لَنَا وَتَرْ حَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "roman": "",
    "translation": "Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers.",
    "refText": "Quran 7:23",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 196,
    "type": "Quranic",
    "heading": "Dua from Quran #17",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #17",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
    "roman": "",
    "translation": "Our Lord! Place us not with the people who are Zalimun (polytheists and wrong_doers). [7:47]",
    "refText": "Quran 7:47",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 197,
    "type": "Quranic",
    "heading": "Dua from Quran #18",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #18",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا افْتَحْ بَيْنَنَاوَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ",
    "roman": "",
    "translation": "Our Lord! Judge between us and our people in truth, for You are the Best of those who give judgment.",
    "refText": "Quran 7:89",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 198,
    "type": "Quranic",
    "heading": "Dua from Quran #19",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #19",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
    "roman": "",
    "translation": "Our Lord! pour out on us patience, and cause us to die as Muslims. [7:126]",
    "refText": "Quran 7:126",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 199,
    "type": "Quranic",
    "heading": "Dua from Quran #20: Asking for protection from enemies",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #20: Asking for protection from enemies",
    "numOfDuas": 1,
    "arabic": "رَبَّنَالاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ: وَنَجِنَا بِرَ حْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
    "roman": "",
    "translation": "Our Lord! Make us not a trial for the folk who are Zalimun (polytheists and wrong-doing) (i.e. do not make them overpower us). And save us\nby Your Mercy from the disbelieving folk.",
    "refText": "Quran 10:85-86",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 200,
    "type": "Quranic",
    "heading": "Dua from Quran #21",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #21",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُُ وَمَا يَخْفَى عَلَى اللّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلا فِي السَّمَاءِ",
    "roman": "",
    "translation": "O our Lord! Certainly, You know what we conceal and what we reveal. Nothing on the earth or in the heaven is hidden from Allah. (Ibrahim\n14:38)",
    "refText": "Quran 14:38",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 201,
    "type": "Quranic",
    "heading": "Dua from Quran #22: Dua for pious offspring",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #22: Dua for pious offspring",
    "numOfDuas": 1,
    "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِوَمِنْ ذُرِّيَّتِي رَبَنَاوَتَقَبَّلْ دُعَاءِ",
    "roman": "",
    "translation": "O my Lord! Make me one who performs As-Salat (Iqamat-as-Salat), and (also) from my offspring, our Lord! And accept my invocation.",
    "refText": "Quran 14:40",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 202,
    "type": "Quranic",
    "heading": "Dua from Quran #23: Dua for forgiveness",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #23: Dua for forgiveness",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَ الدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "roman": "",
    "translation": "O our Lord! Cover (us) with Thy Forgiveness - me, my parents, and (all) Believers, on the Day that the Reckoning will be established !.",
    "refText": "Quran 14:41",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 203,
    "type": "Quranic",
    "heading": "Dua from Quran #24: Dua for mercy and ease from hardship/grief/stress/trouble",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #24: Dua for mercy and ease from hardship/grief/stress/trouble",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِ نَارَشَدًا",
    "roman": "",
    "translation": "Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way",
    "refText": "Quran 18:10",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 204,
    "type": "Quranic",
    "heading": "Dua from Quran #25",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #25",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَى",
    "roman": "",
    "translation": "Our Lord! Verily! We fear lest he should hasten to punish us or lest he should transgress (all bounds against us).",
    "refText": "Quran 20:45",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 205,
    "type": "Quranic",
    "heading": "Dua from Quran #26",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #26",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا آمَنَا فَاغْفِرْ لَنَا وَارْ حَمْنَا وَ أَنْتَ خَيْرُ الرَّاحِمِينَ",
    "roman": "",
    "translation": "Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!",
    "refText": "Quran 23:109",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 206,
    "type": "Quranic",
    "heading": "Dua from Quran #27",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #27",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا إِنَّهَا سَاءتْ مُسْتَقَرًّا وَمُقَامًا",
    "roman": "",
    "translation": "Our Lord! Avert from us the torment of Hell. Verily! Its torment is ever an inseparable, permanent punishment.Evil indeed it (Hell) is as an\nabode and as a place to dwell. [25: 65-66]",
    "refText": "Quran 25:65-66",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 207,
    "type": "Quranic",
    "heading": "Dua from Quran #28",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #28",
    "numOfDuas": 1,
    "arabic": "رَبَّنَاهَبْ لَنَا مِنْ أَزْ وَاجِنَاوَ ذُرِ يَّاتِنَاقُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "roman": "",
    "translation": "Our Lord! Bestow on us from our wives and our offspring who will be the comfort of our eyes, and make us leaders for the Muttaqun (pious).",
    "refText": "Quran 25:74",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 208,
    "type": "Quranic",
    "heading": "Dua from Quran #29",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #29",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ",
    "roman": "",
    "translation": "Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your Way, and save them from the\ntorment of the blazing Fire! [40:7]",
    "refText": "Quran 40:7",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 209,
    "type": "Quranic",
    "heading": "Dua from Quran #30",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua from Quran #30",
    "numOfDuas": 1,
    "arabic": "رَبَّنَاوَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَمَنْ صَلَحَ مِنْ آبَابِهِمْ وَأَزْوَ اجِهِمْ وَذُرِّ يَاتهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ\nالْحَكِيمُ وَقِهِمُ السَّيِّئَاتِ وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَبِذٍ فَقَدْرَ حِمْتَهُ وَذُلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
    "roman": "",
    "translation": "Our Lord! And make them enter the 'Adn (Eden) Paradise (everlasting Gardens) which you have promised them, and to the righteous among\nthelr fathers, thelr wives, and thelr offspring! Verlly, You are the All-Mighty, the All-Wise. And save them from (the punlshment, because of\nwhat they did of) the sins, and whomsoever You save from (the punishment, because of what they did of) the sins (i.e. excuse them) that\nDay, him verily, You have taken into mercy.\\\" And that is the supreme success.",
    "refText": "Quran 40:8-9",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 210,
    "type": "Dua's Importance",
    "heading": "Dua The servant is dependent on his Lord",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua The servant is dependent on his Lord",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اَللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
    "roman": "",
    "translation": "There is none worthy of worship except Allah alone with no partner or associate. He is the Dominion and to Him be all praise, and He is able to do all things. O Allah, one can withhold what You have given and none can give what You have withheld, and no wealth or fortune can benefit anyone for from You comes all wealth and fortune.",
    "refText": "Bukhari: 844",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 211,
    "type": "Dua's Importance",
    "heading": "The servant is dependent on his Lord",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The servant is dependent on his Lord",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ\nالْحَمِّدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرُ، اللَّهُمَّ لَا مَانِعَ لِمَا\nأَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الجَدٍّ مِنْكَ\nالْجدُّ",
    "roman": "",
    "translation": "There is none worthy of worship except Allah alone with no\npartner or associate. He is the Dominion and to Him be all\npraise, and He is able to do all things. O Allah, one can\nwithhold what You have given and none can give what You\nhave withheld, and no wealth or fortune can benefit anyone\nfor from You comes all wealth and fortune.",
    "refText": "Bukhari: 844",
    "refType": "",
    "refChapter": ""
  },
  {
    "id": 212,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #1",
    "numOfDuas": 1,
    "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
    "roman": "",
    "translation": "It is You we worship and It is You we ask for help.",
    "refText": "Surah Al-Fatihah 1:5",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 213,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #2",
    "numOfDuas": 1,
    "arabic": "اِهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ\nتَشَاءً إِلَى صِرَاطٍ مُسْتَقِيْم",
    "roman": "",
    "translation": "Guide me through that which there has been difference\nconcerning the truth, verily, You are upon a straight path.",
    "refText": "Muslim: 770",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 214,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #3",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #3",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ أَعِنِيْ عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنٍ عِبَادَتِكَ",
    "roman": "",
    "translation": "O Allah, help me to remember You, to give You thanks, and\nto perform Your worship in the best manner.",
    "refText": "Sahih (Albani). Abu Dawud: 1522",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 215,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #4",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #4",
    "numOfDuas": 1,
    "arabic": "وَاهْدِنِيْ لِأَحْسَنِ الْأَخْلَاِقِ لَا يَهْدِيْ لِأَحْسَنِهَا إِلَّا أَنْتَ\nوَاصْرِفْ عَنِّي سَيِّنَهَا لَاَ يَصْرِفُ عَنِي سَيِّئَهَا إِلّا أَنْتَ",
    "roman": "",
    "translation": "Guide me to the best of manners for none can guide to the\nbest of them but You. Protect me from bad manners for\nnone can protect against them but You.",
    "refText": "Muslim: 771",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 216,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #5",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #5",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِي أَسْأَلُكَ الْهدُى وَالسَّدَادَ",
    "roman": "",
    "translation": "O Allah, I beg of Thee righteousness and adhering to the\nstraight path.",
    "refText": "Muslim: 2725",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 217,
    "type": "Dua's Importance",
    "heading": "Allah's guidance #6",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Allah's guidance #6",
    "numOfDuas": 1,
    "arabic": "اللَّهمَّ اهْدِنِيْ فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنِ عَافَيْتَ\nوَتَوَلَّنِيْ فَيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي\nشَرَّ مَا قَضَيْتَ فَإِنَّكَ تَقْضِي وَلا يُقْضَى عَلَيْكَ إِنَّهُ لَا\nيَذِلُّ مَنْ وَالَيْتَ وَلَا يَعِزُّ مَّنْ عَادَيْتَ تَبَارَكْتَ رَبَّنَا\nوَتَعَالَیْتَ",
    "roman": "",
    "translation": "O Allah, guide me with those whom You have guided, and\nstrengthen me with those whom You have given strength.\nTake me to Your care with those whom You have taken to\nYour care. Bless me in what You have given me. Protect me\nfrom the evil You have ordained. Surely, You command and\nare not commanded, and none whom You have committed\nto Your care shall be humiliated and none whom You have\ntaken as an enemy shall taste glory. You are Blessed, Our\nLord, and Exalted.",
    "refText": "Sahih (Albani). Abu Dawud: 1425",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 218,
    "type": "Dua's Importance",
    "heading": "Asking for forgiveness #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for forgiveness #1",
    "numOfDuas": 1,
    "arabic": "رَبِّ اغْفِرْ لي وَتُبْ عَلَىَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
    "roman": "",
    "translation": "O Allah forgive me and accept my repentance, for You are\nthe Accepter of repentance, the Most Merciful.",
    "refText": "Sahih (Albani). Abu Dawud: 1516",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 219,
    "type": "Dua's Importance",
    "heading": "Asking for forgiveness #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Asking for forgiveness #2",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ أَعِنِي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنٍ عِبَادَتِكَ",
    "roman": "",
    "translation": "O Allah, help me to remember You, to give You thanks, and\nto perform Your worship in the best manner.",
    "refText": "Sahih (Albani). Abu Dawud: 1522",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 220,
    "type": "Dua's Importance",
    "heading": "Ask for paradise & seek refuge\nfrom fire",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Ask for paradise & seek refuge\nfrom fire",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
    "roman": "",
    "translation": "O Allah, I ask You for Paradise and seek Your protection\nfrom the Fire.",
    "refText": "Sahih (Albani). Ibn Majah: 910",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 221,
    "type": "Dua's Importance",
    "heading": "Dua to remain steadfast on the\nreligion",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua to remain steadfast on the\nreligion",
    "numOfDuas": 1,
    "arabic": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِيْ عَلَى دِيْنِكَ",
    "roman": "",
    "translation": "O Changer of the Hearts! Strengthen my heart upon Your\nReligion.",
    "refText": "Sahih (Albani). Tirmidhi: 3522",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 222,
    "type": "Dua's Importance",
    "heading": "To get Stability in religion and\ngood results in all deeds",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "To get Stability in religion and\ngood results in all deeds",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ",
    "roman": "",
    "translation": "O Allah! Controller of the hearts, direct our hearts to Your\nobedience.",
    "refText": "Muslim: 2655",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 223,
    "type": "Dua's Importance",
    "heading": "Dua to remain stead fast on the\nreligion",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua to remain stead fast on the\nreligion",
    "numOfDuas": 1,
    "arabic": "يَا وَلِيَّ الْإِسْلَامِ وَأَهْلِهُ تَبِتْنِيْ بِهِ حَتَّى أَلَّقَاكَ.",
    "roman": "",
    "translation": "O guardian of Islam and Muslims, keep me steadfast on\nIslam till the day when I will have the good fortune to meet\nyou.",
    "refText": "Proved on the basis of all sanads (Albani). Silsilatus Sahihah\n1823",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 224,
    "type": "Dua's Importance",
    "heading": "Good results and protection in\nall activities",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Good results and protection in\nall activities",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا في الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ\nخِزْيِ الدُّنْيَا وَعَذَابِ الآَخِرَةِ",
    "roman": "",
    "translation": "O Allah! grant us a good outcome on all of our affairs and\nsave us from the disgrace of this world and the punishment\nof the Hereafter.",
    "refText": "Sahih (Suyuti). Jami'us Sagir: 1450",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 225,
    "type": "Dua's Importance",
    "heading": "Seeking good of this world and\nthe hereafter #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking good of this world and\nthe hereafter #1",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ أَصْلِحٍ لِى دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ\nلِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لي آخِرَتِيِ الَّتِي\nفِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاَةُ زِيَادَةً لي فِي كُلِّ خَيْرٍ،\nوَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِ شَرٍّ",
    "roman": "",
    "translation": "O Allah perfect for me my religion on which success of all\nmy affairs depends, And perfect my worldly affairs on which\nmy livelihood depends, And perfect my hereafter to which I\nwill return, And make in life for me an increase of all good,\nAnd make death for me a comfort from all evil.",
    "refText": "Muslim: 2720",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 226,
    "type": "Dua's Importance",
    "heading": "Seeking good of this world and\nthe hereafter #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking good of this world and\nthe hereafter #2",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ\nوَفُجَاءَةِ نِقْمَتِكَ وَجَمِيع سَخَطِكَ",
    "roman": "",
    "translation": "O Allah, I seek refuge with You from deprivation of Your\nblessing, alteration of Your protection, sudden infliction of\nYour anger, and all Your wrath.",
    "refText": "Muslim: 2739",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 227,
    "type": "Dua's Importance",
    "heading": "Shelter from evil consequences\nand rejoicing of the enemy",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Shelter from evil consequences\nand rejoicing of the enemy",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِي أَعُوْذُ بِكَ مِنَ الْفَمِّ وَالْحَزَنِ، وَالْعَجْزِ\nوَالْكَسَلِ، وَالَّبُخْلِ وَالْجُبْنِ، وَضَلَعَ الدَّيْنِ وَغَلَبَةِ\nالرِّجَالِ",
    "roman": "",
    "translation": "O Allah, I seek refuge in you from grief and sadness, from\nweakness and from laziness, from miserliness and from\ncowardice, from being overcome by debt and overpowered\nby men",
    "refText": "Bukhari :2893",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 228,
    "type": "Dua's Excellence",
    "heading": "The reward of freeing the four\nslaves of Bani Ismail (AS)",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "The reward of freeing the four\nslaves of Bani Ismail (AS)",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ\nالْحَمَّدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِیرُ",
    "roman": "",
    "translation": "None has the right to be worshipped except Allah, alone,\nwithout any partner. To Him belong all sovereignty and\npraise and He is over all things omnipotent.",
    "refText": "Bukhari No: 6403; Muslim No: 2693",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 229,
    "type": "Dua's Excellence, Dua's Importance",
    "heading": "Sins will be forgiven even if like\nthe foam of the sea",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Sins will be forgiven even if like\nthe foam of the sea",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
    "roman": "",
    "translation": "Glorified is Allah and praised is He.",
    "refText": "Bukhari: 6405",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 230,
    "type": "Dua's Excellence",
    "heading": "Excellence of doing Tasbeeh,\nTahmid, Tahlil, Takbeer",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Excellence of doing Tasbeeh,\nTahmid, Tahlil, Takbeer",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللَهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيم",
    "roman": "",
    "translation": "Glory be to Allah and all praise is due to him, glory be to\nAllah the great.",
    "refText": "Bukhari: 6406",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 231,
    "type": "Dua's Excellence",
    "heading": "Most beloved words to Allah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Most beloved words to Allah",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّاّ اللَّهُ وَاللَّهُ أَكْبَرُ",
    "roman": "",
    "translation": "How perfect Allah is, and all praise is for Allah. None has\nthe right to be worshipped except Allah, and Allah is the\ngreatest. [1]",
    "refText": "Muslim: 2137",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 232,
    "type": "Dua's Excellence, Illness",
    "heading": "Seeking good of this world and\nthe hereafter",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Seeking good of this world and\nthe hereafter",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللهِ",
    "roman": "",
    "translation": "One thousand virtues are recorded (to your credit) and one\nthousand vices are blotted out.",
    "refText": "Muslim: 2698",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 233,
    "type": "Dua's Excellence",
    "heading": "Build a house in Paradise",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Build a house in Paradise",
    "numOfDuas": 1,
    "arabic": "قل هو الله أحدالله الصمدلم يلد ولم يولدولم يكن له كفوا أحد",
    "roman": "",
    "translation": "In the name of Allah, the Entirely Merciful, the Especially\nMerciful. (1) Say, \"He is Allah, [who is] One, (2) Allah, the\nEternal Refuge. (3) He neither begets nor is born, (4) Nor is\nthere to Him any equivalent.\" (Sura Ikhlas: 1-4)",
    "refText": "Sahih (Albani). Sahih Al Jame: 6472",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 234,
    "type": "Dua's Excellence",
    "heading": "Date palm planted in Paradise",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Date palm planted in Paradise",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ",
    "roman": "",
    "translation": "How perfect Allah is, The Supreme, and I praise Him.",
    "refText": "Sahih (Albani). Tirmidhi: 3464",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 235,
    "type": "Dua's Excellence, Dua's Importance",
    "heading": "Treasure of Paradise",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Treasure of Paradise",
    "numOfDuas": 1,
    "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
    "roman": "",
    "translation": "There is no might nor power except with Allah.",
    "refText": "Bukhari: 6384",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 236,
    "type": "Dua's Excellence",
    "heading": "Glory be to Allah with praise",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Glory be to Allah with praise",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، اللهُ أَكْبَرُ كَبِيرًا،\nوَالْحَمْدُّ لِلَّهِ كَثِيِرًا، سُبْحَانَ اللهِ رَبِّ الْعَالَمِينَ، لَاَ حَوْلَ\nوَلَا قُوَّةَ إِلَّا بِاللّهِ الْعَزِيزِ الْحَكِيم",
    "roman": "",
    "translation": "None has the right to be worshipped except Allah, alone\nwithout any partener. Allah is most great and much praise\nis for Allah. How perfect Allah is, Lord of the worlds. There\nis no might nor power except with Allah, The Exalted in\nmight, The Wise.",
    "refText": "Muslum: 2696",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 237,
    "type": "Dua's Excellence",
    "heading": "Dua to be recited after accepting\nIslam",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua to be recited after accepting\nIslam",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي",
    "roman": "",
    "translation": "O Allah, forgive me, have mercy upon me, guide me and\ngrant me sustenance.",
    "refText": "Muslim: 2697",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 238,
    "type": "Dua's Excellence",
    "heading": "Best Supplication & Best Dhikr #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Best Supplication & Best Dhikr #1",
    "numOfDuas": 1,
    "arabic": "الْحَمْدُ لِلهِ",
    "roman": "",
    "translation": "All praise is for Allah.",
    "refText": "Hasan (Albani). Tirmidhi: 3383",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 239,
    "type": "Dua's Excellence",
    "heading": "Best Supplication & Best Dhikr #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Best Supplication & Best Dhikr #2",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إلَّا اللهُ",
    "roman": "",
    "translation": "None has the right to be worshipped except Allah.",
    "refText": "Hasan (Albani). Tirmidhi: 3383",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 240,
    "type": "Dua's Excellence",
    "heading": "Excellence of doing Tasbeeh",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Excellence of doing Tasbeeh",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ\nلَا حَوْلَ وَلَا قُوَّةَ إِلَّاّ بِاللهِ",
    "roman": "",
    "translation": "How perfect Allah is, and all praise is for Allah. None has\nthe right to be worshipped except Allah, and Allah is the\ngreatest. There is no might nor power except with Allah.",
    "refText": "Musnad-e Ahmad (no. 513) (Ahmad Shakir, ed.) and its chain\nof narration is authentic. See Majma'uz-Zawa'id 1/297. Ibn\nHajar mentions it in Bulughul-Maram saying that Ibn Hibban\nand Al-Hakim considered it authentic.",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 241,
    "type": "Dua's Excellence",
    "heading": "About Lailatul Qadr",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "About Lailatul Qadr",
    "numOfDuas": 1,
    "arabic": "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (ج وَمَا أَدْرَاكَ مَا لَيْلَةُ\nالْقَدْرِ ٢ لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرِتَنَزَّلُالْمَلَابِكَةُ وَالزُّوحُ فِيهَا بِإِذْنِ رَيِّهِم مِّن كُلِ أمْرٍ (ج)\nسَلَامَ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ",
    "roman": "",
    "translation": "Indeed, We sent the Qur'an down during the Night of\nDecree. (2) And what can make you know what is the Night\nof Decree? (3) The Night of Decree is better than a\nthousand months. (4) The angels and the Spirit descend\ntherein by permission of their Lord for every matter. (5)\nPeace it is until the emergence of dawn.",
    "refText": "Surah Al-Qadr 97:1-5",
    "refType": "Quran",
    "refChapter": ""
  },
  {
    "id": 242,
    "type": "Time of Dua",
    "heading": "Times and places when dua will\nbe accepted",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Times and places when dua will\nbe accepted",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ إِنَّكَ عَفُوُ كَرِيمُ تُحِبُّ الْعَقْوَ فَاعْفُ عَنِّي",
    "roman": "",
    "translation": "O Allah, You are Most Forgiving, Generous. You love\nforgiveness; so forgive me.",
    "refText": "Sahih (Albani). Tirmidhi: 3513",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 243,
    "type": "Time of Dua",
    "heading": "Dua at the last part of the night",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua at the last part of the night",
    "numOfDuas": 1,
    "arabic": "كَانُوا قَلِيلا مِّنَ اللَّيْلِ مَا يَهْجَعُونَوَبِالْأَسْحَارِ مُمْيَسْتَغْفِرُونَ",
    "roman": "",
    "translation": "They used to sleep but little of the night, (18) And in\nthe hours before dawn they would ask forgiveness.",
    "refText": "Bukhari: 1145",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 244,
    "type": "Time of Dua",
    "heading": "Times and places when dua will\nbe accepted",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Times and places when dua will\nbe accepted",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ\nالْحَمَّدُ وَهُوَ عِلَى كُلِّ شَيْءٍ قَدِيرُ الْحَمْدُ لِلَّهِ وَسُبْحَانَ\nاللَه وَلَا إِلَهَ إِلَّاّ اللّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا\nبِاللهِ",
    "roman": "",
    "translation": "O Allah! Forgive me. Or invokes (Allah), he will be\nresponded to and if he performs ablution (and prays), his\nprayer will be accepted.",
    "refText": "Bukhari: 1154",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 245,
    "type": "Time of Dua",
    "heading": "Dua of Yunus (AS)",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua of Yunus (AS)",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِي كُنْتُ مِنَ الظَّالِمِيْنَ",
    "roman": "",
    "translation": "There is none worthy of worship but You, glory is to You.\nSurely, I was among the wrongdoers.",
    "refText": "Sahih (Albani). Tirmidhi: 3505",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 246,
    "type": "Time of Dua",
    "heading": "Dua for one who afflicted by a\ncalamity",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for one who afflicted by a\ncalamity",
    "numOfDuas": 1,
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ، اللَّهُمّ أَجُرْبيْ فِي مُصِيْبَتِيْ\nوَأَخْلِفْ لِي خَيْرًا مِّنْهَا",
    "roman": "",
    "translation": "We are from Allah and unto Him we return. O Allah take me\nout of my plight and bring to me after it something better.",
    "refText": "Muslim: 918",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 247,
    "type": "Time of Dua",
    "heading": "Dua at the begining of the\nprayer #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua at the begining of the\nprayer #1",
    "numOfDuas": 1,
    "arabic": "اللهُ أَكْبَرُ كَبِيْرًا وَالْحَمْدُ لِلَّهِ كَثِيْرًا وَسُبْحَانَ اللهِ بُكْرَةً\nوَأَصِيْلا",
    "roman": "",
    "translation": "Allah is the Greatest, Most Great. Praise is to Allah,\nabundantly. Glory is to Allah, at the break of day and at its\nend.",
    "refText": "Muslim: 601",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 248,
    "type": "Time of Dua",
    "heading": "Dua after getting up from the\nrukoo",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua after getting up from the\nrukoo",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِبًا مُبَارَكًا فِيهِ",
    "roman": "",
    "translation": "Our Lord, praise is Yours, abundant, good and blessed\npraise.",
    "refText": "Bukhari: 799",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 249,
    "type": "Time of Dua",
    "heading": "Dua after rising from rukoo",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua after rising from rukoo",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ",
    "roman": "",
    "translation": "O Allah, our Lord and to You be the praise.",
    "refText": "Bukhari: 796",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 250,
    "type": "Time of Dua",
    "heading": "Before salam #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Before salam #1",
    "numOfDuas": 1,
    "arabic": "الِلَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ\nالَّذِي لَمْ بَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدُ أَنْ\nتَغْفِرَ لِي ذُنُوبي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "roman": "",
    "translation": "O Allah, I ask of You, O Allah, as You are the One, the Only,\nthe Self-Sufficient Master, Who begets not nor was He\nbegotten, and there is None equal or comparable to Him,\nforgive me my sins, for You are the Oft-Forgiving, Most\nMerciful.",
    "refText": "Sahih (Albani). Nasai: 1301",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 251,
    "type": "Time of Dua",
    "heading": "Before salam #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Before salam #2",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ\nبَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا\nحيٌّ یَا قَيُّوْمُ",
    "roman": "",
    "translation": "O Allah, I ask Thee by virtue of the fact that praise is due\nto Thee, there is no deity but Thou, Who showest favour\nand beneficence, the Originator of the Heavens and the\nearth, O Lord of Majesty and Splendour, O Living One, O\nEternal One.",
    "refText": "Sahih (Albani). Abu Dawud: 1495",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 252,
    "type": "Time of Dua",
    "heading": "Before salam #3",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Before salam #3",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ إِنِي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ اَنْتَ اللّهُ لَا إِلَهَ إِلَّا\nأَنْتَ الأَحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُؤْلَدْ وَلَمْ يَكُنْ\nلَهُ كُفُوًا أَحَدُ",
    "roman": "",
    "translation": "O Allah, I ask You, by the fact that I bear witness that You\nare Allah. There is none worthy of worship but You, the\nOnly God, Independent of creation, who was not begotten\nand begets not, and none is equal to Him.",
    "refText": "Sahih (Albani). Abu Dawud: 1493",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 253,
    "type": "Time of Dua",
    "heading": "Reciting specific dua after\nablution",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Reciting specific dua after\nablution",
    "numOfDuas": 1,
    "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحدَهُ لَا شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ\nمُحَمَّدًا عَبْدُهُ وَرَسُوْلَهُ",
    "roman": "",
    "translation": "I bear witness that none has the right to be worshipped but\nAllah alone, Who has no partner; and I bear witness that\nMuhammad () is His slave and His Messenger.",
    "refText": "Muslim: 234",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 254,
    "type": "Time of Dua",
    "heading": "Dua in the day of 'Arafah at\n'Arafat",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in the day of 'Arafah at\n'Arafat",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إِلَّاّ اللّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ\nالْحَمَّدُ وَهُوَ عَلَى كُلِّ شَيءٍ قَدِیرُ",
    "roman": "",
    "translation": "None has the right to be worshiped except Allah, alone,\nwithout partner. To Him belongs sovereignty and all praise\nand He is over all things omnipotent.",
    "refText": "Hasan (Albani). Tirmidhi: 3585",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 255,
    "type": "Dua Acceptance",
    "heading": "Who wakes up at night and\nrecites certain dua",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Who wakes up at night and\nrecites certain dua",
    "numOfDuas": 1,
    "arabic": "لَا إِلَهَ إلَّا اللّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ\nالْحَمَّدُ وَهُوَ عِلَى كُلِّ شَىْءٍ قَدِيْرُ. الْحَمْدُ لِلَّهِ، وَسُبْحَانَ\nالِلَهِ، وَلَا إِلَهَ إِلَّا اللّهُ، وَاللَّهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ\nإِلَّاّ بِاللّهِ",
    "roman": "",
    "translation": "None has the right to be worshipped but Allah. He is the\nOnly One and has no partners. For Him is the Kingdom and\nall the praises are due for Him. He is Omnipotent. All the\npraises are for Allah. All the glories are for Allah. And none\nhas the right to be worshipped but Allah, And Allah is Great\nAnd there is neither Might nor Power Except with Allah.",
    "refText": "Bukhari: 1154",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 256,
    "type": "Dua Acceptance",
    "heading": "When in danger",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "When in danger",
    "numOfDuas": 1,
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ اَللَّهُمَّ أُجُرْبِيْ فِي مُصِيْبَتِيْ\nوَأَخْلِفْ لِي خَيْرًا مِّنْهَا",
    "roman": "",
    "translation": "We are from Allah and unto Him we return. O Allah take me\nout of my plight and bring to me after it something better.",
    "refText": "Muslim: 918",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 257,
    "type": "Dua Acceptance",
    "heading": "Making dua by the help of the\ngreatest name of Allah",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Making dua by the help of the\ngreatest name of Allah",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ إِنِي أَسْأَلُكَ بِأَنَّ أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ ِلَّاَ\nأَنْتَ الأَحَدُ الصَّمَّدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُؤْلَدْ وَلَمْ يَكُنْ\nلَهُ كُفُوًا أَحَدُّ",
    "roman": "",
    "translation": "O Allah, I ask You, by the fact that I bear witness that You\nare Allah. There is none worthy of worship but You, the\nOnly God, Independent of creation, Who was not begotten\nand begets not, and none is equal to Him.",
    "refText": "Sahih (Albani). Nasai: 1300",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 258,
    "type": "Dua Acceptance",
    "heading": "Dua recited during Tashahhud",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua recited during Tashahhud",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ إِنِي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ اِلَّا أَنْتَ الْمَنَّانُ،\nبَدِيعُ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا\nحَيُّ یَا قَيُّوْمُ",
    "roman": "",
    "translation": "O Allah, I ask Thee by virtue of the fact that praise is due\nto Thee, there is no deity but Thou, Who showest favour\nand beneficence, the Originator of the Heavens and the\nearth, O Lord of Majesty and Splendour, O Living One, O\nEternal One.",
    "refText": "Sahih (Albani). Nasai: 1300",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 259,
    "type": "Salah",
    "heading": "Duas After Takbeer (Start of\nprayer)",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Duas After Takbeer (Start of\nprayer)",
    "numOfDuas": 1,
    "arabic": "سُبِحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ\nوَلَا إِلهَ غَيْرُْكُ",
    "roman": "",
    "translation": "Glory is to You O Allah, and praise. Blessed is Your Name\nand Exalted is Your Majesty. There is none worthy of\nworship but You.",
    "refText": "Muslim: 399",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 260,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#2",
    "numOfDuas": 1,
    "arabic": "وَجَّهْثُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ حَنِيفًا\nوَمَا أَنَا مِنَ المُشْرِ كِينَ، إَِّ صَلَاتِي، وَنُسُكِي، وَمَحْيَايَ،\nوَمَمَاتِي لِلَّهِ رَتِّ الْعَالَمِينَ، لَا شَرِيكَ لَهُ وَبِذَّلِكَ أَمِرْتُ\nوَأَنَا مِنَ الْمُسْلِمِينَ اللَّهُمَّ أَنْتَ المَلِكُ لَا إِلَّهَ إِلَّا أَنْتَ،\nأَنْتَ رَبِي وَأَنَا عَبْدُكَ، ظُلَمْتُ نَفْسِي وَاعْتَرَفَتٍ بِذَنْبِي\nفَاغْفِرْ لِي ذُنُوبي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ،\nوَاهْدِنِي لِأَحْسَنِ الأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِها إِلَّا أَنْتِ،\nوَاصْرِفْ عَنِّي سَيِّنَهَا، لَاَ بَصْرِفُ عَنِي سَيَّنَهَاَ إِلَّا أَنْتَ\nلَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَّيْسَ\nإِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ\nوَأَتوبُ إِلَيْكَ",
    "roman": "",
    "translation": "I have turned my face sincerely towards He who has\nbrought forth the heavens and the Earth and I am not of\nthose who associate (others with Allah). Indeed my prayer,\nmy sacrifice, my life and my death are for Allah, Lord of the\nworlds, no partner has He, with this I am commanded and I\nam of the Muslims. O Allah, You are the Sovereign, none\nhas the right to be worshipped except You. You are my\nLord and I am Your servant, I have wronged my own soul\nand have acknowledged my sin, so forgive me all my sins\nfor no one forgives sins except You. Guide me to the best\nof characters for none can guide to it other than You, and\ndeliver me from the worst of characters for none can\ndeliver me from it other than You. Here I am, in answer to\nYour call, happy to serve you. All good is within Your hands\nand evil does not stem from You. I exist by your will and\nwill return to you. Blessed and High are You, I seek Your\nforgiveness and repent unto You.",
    "refText": "Muslim: 771",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 261,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#3",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#3",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ\nالْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِنِيْ مِنَ الْخَطَايَا كَمَا يُنَقَى\nالثَّوْبُ الْأَبْيَضَُ مِنَ الدَّنَسِ، اللُّهُمَّ اغْسِلْ خَطَايَايَ بِالْمَاءِ\nوَالثَّلْجِ وَالْبَرَدِ",
    "roman": "",
    "translation": "O Allah! separate me from my sins as You have separated\nthe East from the West. O Allah, cleanse me of my\ntransgressions as the white garment is cleansed of stains. O\nAllah! wash away my sins with ice and water and frost.",
    "refText": "Bukhari: 744",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 262,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#4",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#4",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ رَبَّ جِبْرَابِيْلَ وَمِيْكَابِيْلَ وَإِسْرَافِيلَ فَاطِرَ\nالسَّمَوَاتِ وَالأرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ\nتَحْكُمُ بَيْنَ عِبَادِكَ فِيمًا كَانُوا فِيهِ يَخْتَلِفُونَ اِهْدِنِي\nلِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ\nإِلَى صِرَاطٍ مُسْتَقِيم",
    "roman": "",
    "translation": "O Allah, Lord of Jibra-eel, Meeka-eel and Israfeel (great\nangles), Creator of the heavens and the Earth, Knower of\nthe seen and the unseen. You are the arbitrator between\nYour servants in that which they have disputed. Guide me\nto the truth by Your leave, in that which they have differed,\nfor verily You guide whom You will to a straight path.",
    "refText": "Muslim: 770",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 263,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#5",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#5",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيمُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ\nوَلَكَّ الْحَمْدُ، لَكَ مُلْكُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ،\nوَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ، وَلَكَ الحَمْدُ\nأَنْتَ الْحَقُّ وَوَعْدُكَ الْجَقُّ، وَلِقَاؤُكَ حَيٍّ، وَقَوْلُكَ حَقُّ،\nوَالْجَنَّةُ حَقُّ، وَالنَّارُ حَقُّ، وَالتَّبِيُّونَ حَقُّ، وَمُحَمَّدُ مَلا له\nحَقُّ، وَالسَّاعةُ حَقُّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنُتُ\nوَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ\nحَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخِّرْتُ، وَمَا\nأَسْرَرتُ وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لَا\nإِلَهَ إلَّا أَنْتَ (لَا إِلَهَ غَيْرُكَ)",
    "roman": "",
    "translation": "O Allah! All the praises are for you, You are the Holder of\nthe Heavens and the Earth, And whatever is in them. All the\npraises are for You; You have the possession of the Heavens\nand the Earth And whatever is in them. All the praises are\nfor You; You are the Light of the Heavens and the Earth\nAnd all the praises are for You; You are the King of the\nHeavens and the Earth; And all the praises are for You; You\nare the Truth and Your Promise is the truth, And to meet\nYou is true, Your Word is the truth And Paradise is true And\nHell is true And all the Prophets (Peace be upon them) are\ntrue; And Muhammad () is true, And the Day of\nResurrection is true. O Allah ! I surrender (my will) to You; I\nbelieve in You and depend on You. And repent to You, And\nwith Your help I argue (with my opponents, the non-\nbelievers) And I take You as a judge (to judge between us).\nPlease forgive me my previous And future sins; And\nwhatever I concealed or revealed And You are the One who\nmake (some people) forward And (some) backward. There is\nnone to be worshipped but you.",
    "refText": "Bukhari: 1120",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 264,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#6",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#6",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا\nعَبْدُكَ، ظَلَمْتُ نَفْسِي وَاَعْتَرَفْتُ بِذَنْبِي فَّاغْفِرْ لِي\nذُنُوبي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّاَ أَنْتِ، وَاهْدِنِي\nلِأَخْسْنِ الْأَخْلاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ، وَاضَّرِفْ\nعَنِّي سَيِّنَهَا، لَاَ يَصْرِفُ عَنِّي سَيِّنَهَا إِلاَّ أَنْتَ.",
    "roman": "",
    "translation": "O Allah, You are the Sovereign, none has the right to be\nworshipped except You. You are my Lord and I am Your\nservant, I have wronged my own soul and have\nacknowledged my sin, so forgive me all my sins for no one\nforgives sins except You. Guide me to the best of characters\nfor none can guide to it other than You, and deliver me\nfrom the worst of characters for none can deliver me from\nit other than You.",
    "refText": "Muslim: 771",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 265,
    "type": "Salah",
    "heading": "At the beginning of the prayer\n#7",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "At the beginning of the prayer\n#7",
    "numOfDuas": 1,
    "arabic": "لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ\nإِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ\nوَأَتُوبُ إِلَيْكَ",
    "roman": "",
    "translation": "Here I am, in answer to Your call, happy to serve you. All\ngood is within Your hands and evil does not stem from You.\nI exist by your will and will return to you. Blessed and High\nare You, I seek Your forgiveness and repent unto You.",
    "refText": "Muslim: 771",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 266,
    "type": "Salah",
    "heading": "If afflicted by whisperings in\nprayer or recitation",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "If afflicted by whisperings in\nprayer or recitation",
    "numOfDuas": 1,
    "arabic": "أَعُوْذُ بِاللّهِ مِنَ الشَّيْطَانِ الرَّجِيْم",
    "roman": "",
    "translation": "I seek refuge in Allah from Satan the outcast.",
    "refText": "Muslim: 2203",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 267,
    "type": "Salah",
    "heading": "Dua in rukoo #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #1",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
    "roman": "",
    "translation": "Glory to my Lord the Exalted.",
    "refText": "Sahih (Albani). Tirmidhi: 262",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 268,
    "type": "Salah",
    "heading": "Dua in rukoo #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #2",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ رَبِيَ الْعَظِيمِ وَبِحَمْدِهِ",
    "roman": "",
    "translation": "Glory and praise be to my mighty Lord.",
    "refText": "Hasan Sanad (Shu'aib Al-Arnaut). Abu Dawud: 870",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 269,
    "type": "Salah",
    "heading": "Dua in rukoo #3",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #3",
    "numOfDuas": 1,
    "arabic": "سُبُّوْع قُدُوْسُ رَبُّ الْمَلَابِكَةِ وَالزُّوح",
    "roman": "",
    "translation": "Glory (to You), Most Holy (are You), Lord of the angels and\nthe Spirit.",
    "refText": "Sahih (Albani). Abu Dawud: 872",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 270,
    "type": "Salah",
    "heading": "Dua in rukoo #4",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #4",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْثُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ\nسَمْعِيْ وَبَصَرِيْ وَمُجِّيْ وَعِظَامِيْ وَعَصَبِيْ",
    "roman": "",
    "translation": "O Allah, to You I bow (in prayer) and in You I believe and to\nYou I have submitted. Before You my hearing is humbled, as\nis my sight, my mind, my bones, my nerves.",
    "refText": "Sahih (Albani). Abu Dawud: 760",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 271,
    "type": "Salah",
    "heading": "Dua in rukoo #5",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #5",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوْتِ وَالْكِبْرِيَاءِ\nوَالْعَظَمَةِ",
    "roman": "",
    "translation": "Glory is to You, Master of power, of dominion, of majesty\nand greatness.",
    "refText": "Sahih (Albani). Abu Dawud: 873",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 272,
    "type": "Salah",
    "heading": "Dua in rukoo #6",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #6",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَكَ وَبِحَمْدِكَ أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
    "roman": "",
    "translation": "Glory is to You O Allah, and praise. I ask you for forgiveness\nand I turn to you (from sinning).",
    "refText": "Hasan (Albani). Silsila Sahiha: 3032",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 273,
    "type": "Salah",
    "heading": "Dua in rukoo #7",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #7",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لي",
    "roman": "",
    "translation": "Glory is to You, O Allah, our Lord, and praise is Yours. O\nAllah, forgive me. [1]",
    "refText": "[1] Bukhari: 794\n[2] Sura Nasr 110:3",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 274,
    "type": "Salah",
    "heading": "Dua in rukoo #8",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #8",
    "numOfDuas": 1,
    "arabic": "اَللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسِلَمْتُ، أَنْتَ رَبِّي،\nخَشَعَ لَكَ سَمْعِي وَبَصَرِيٍ وَمُخِّي وَعَظْمِي وَعَصَبِي\nوَمَا اِسْتَقَلَّتْ بِّهِ قَدَمِيَ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "roman": "",
    "translation": "O Allah, I have bowed down to You, I have believed, I have\nsurrendered. You are my Rabb, my ear-eye, my brain, my\nbones, my spine and my legs, all that you are carrying (i.e.\nmy existence) have been humbled before Allah Almighty.",
    "refText": "Sahih (Al-Aini). Nukhbul Afkaar 4/247",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 275,
    "type": "Salah",
    "heading": "Dua in rukoo #9",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua in rukoo #9",
    "numOfDuas": 1,
    "arabic": "سُبْحَانَكَ اَللَّهُمَّ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ",
    "roman": "",
    "translation": "O Allah glory is to You; there is no worthy of worship\nexcept You.",
    "refText": "Sahih (Albani). Nasai: 1131",
    "refType": "Hadith",
    "refChapter": ""
  },
  {
    "id": 276,
    "type": "Salah",
    "heading": "Dua for rising from rukoo #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for rising from rukoo #1",
    "numOfDuas": 1,
    "arabic": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ",
    "roman": "",
    "translation": "Allah hears whoever praises Him.",
    "refText": "Bukhari:",
    "refType": "Hadith",
    "refChapter": 796
  },
  {
    "id": 277,
    "type": "Salah",
    "heading": "Dua for rising from rukoo #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua for rising from rukoo #2",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ، مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ،\nوَمِلءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ،\nأَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدُ، اللَّهُمَّ لَا مَانِعَ لِمَا\nأَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ\nمِنْكَ الْجَدُّ",
    "roman": "",
    "translation": "O Allah, our Rabb (Lord), to You is praise in all the heavens\nand all the earth, and all that You Will (to create)\nafterwards, O You, Who are worthy of praise and glory, the\nmost worthy of what a slave says - and we are all Your\nslaves: no one can withhold what You give, or give what\nYou withhold, and riches cannot avail a wealthy person\nagainst You.",
    "refText": "Muslim:",
    "refType": "Hadith",
    "refChapter": 477
  },
  {
    "id": 278,
    "type": "Salah",
    "heading": "Dua while in a state of rukoo #1",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua while in a state of rukoo #1",
    "numOfDuas": 1,
    "arabic": "اللَّهُمَ) رَبَّنَا لَكَ الْحَمْدُ",
    "roman": "",
    "translation": "Our Lord, to You be the praise.",
    "refText": "Bukhari:",
    "refType": "Hadith",
    "refChapter": 796
  },
  {
    "id": 279,
    "type": "Salah",
    "heading": "Dua while in a state of rukoo #2",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua while in a state of rukoo #2",
    "numOfDuas": 1,
    "arabic": "(اللَّهُمَ) رَبَّنَا وَلَكَ الْحَمْدُ",
    "roman": "",
    "translation": "O Allah, our Lord and to You be the praise.",
    "refText": "Bukhari:",
    "refType": "Hadith",
    "refChapter": 795
  },
  {
    "id": 280,
    "type": "Salah",
    "heading": "Dua while in a state of rukoo #3",
    "totalCount": 1,
    "numSubCategories": 0,
    "subHeading": "Dua while in a state of rukoo #3",
    "numOfDuas": 1,
    "arabic": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
    "roman": "",
    "translation": "Our Lord, praise is Yours, abundant, holy and blessed praise.",
    "refText": "Bukhari:",
    "refType": "Hadith",
    "refChapter": 799
  }
]
